pub mod lklh {
    #![allow(nonstandard_style)]
    pub const LKL_CONFIG_64BIT: u32 = 1;
    pub const __LKL__BITS_PER_LONG: u32 = 64;
    pub const __LKL__FD_SETSIZE: u32 = 1024;
    pub const __lkl__NR_io_setup: u32 = 0;
    pub const __lkl__NR_io_destroy: u32 = 1;
    pub const __lkl__NR_io_submit: u32 = 2;
    pub const __lkl__NR_io_cancel: u32 = 3;
    pub const __lkl__NR_io_getevents: u32 = 4;
    pub const __lkl__NR_setxattr: u32 = 5;
    pub const __lkl__NR_lsetxattr: u32 = 6;
    pub const __lkl__NR_fsetxattr: u32 = 7;
    pub const __lkl__NR_getxattr: u32 = 8;
    pub const __lkl__NR_lgetxattr: u32 = 9;
    pub const __lkl__NR_fgetxattr: u32 = 10;
    pub const __lkl__NR_listxattr: u32 = 11;
    pub const __lkl__NR_llistxattr: u32 = 12;
    pub const __lkl__NR_flistxattr: u32 = 13;
    pub const __lkl__NR_removexattr: u32 = 14;
    pub const __lkl__NR_lremovexattr: u32 = 15;
    pub const __lkl__NR_fremovexattr: u32 = 16;
    pub const __lkl__NR_getcwd: u32 = 17;
    pub const __lkl__NR_lookup_dcookie: u32 = 18;
    pub const __lkl__NR_eventfd2: u32 = 19;
    pub const __lkl__NR_epoll_create1: u32 = 20;
    pub const __lkl__NR_epoll_ctl: u32 = 21;
    pub const __lkl__NR_epoll_pwait: u32 = 22;
    pub const __lkl__NR_dup: u32 = 23;
    pub const __lkl__NR_dup3: u32 = 24;
    pub const __lkl__NR3264_fcntl: u32 = 25;
    pub const __lkl__NR_inotify_init1: u32 = 26;
    pub const __lkl__NR_inotify_add_watch: u32 = 27;

    pub const LKL_IORING_FEAT_SUBMIT_STABLE: u32 = 4;
    pub const LKL_IORING_FEAT_RW_CUR_POS: u32 = 8;
    pub const LKL_IORING_FEAT_CUR_PERSONALITY: u32 = 16;
    pub const LKL_IORING_FEAT_FAST_POLL: u32 = 32;
    pub const LKL_IORING_FEAT_POLL_32BITS: u32 = 64;
    pub const LKL_IO_URING_OP_SUPPORTED: u32 = 1;
    pub const LKL_AF_UNSPEC: u32 = 0;
    pub const LKL_AF_UNIX: u32 = 1;
    pub const LKL_AF_LOCAL: u32 = 1;
    pub const LKL_AF_INET: u32 = 2;
    pub const LKL_AF_AX25: u32 = 3;
    pub const LKL_AF_IPX: u32 = 4;
    pub const LKL_AF_APPLETALK: u32 = 5;
    pub const LKL_AF_NETROM: u32 = 6;
    pub const LKL_AF_BRIDGE: u32 = 7;
    pub const LKL_AF_ATMPVC: u32 = 8;
    pub const LKL_AF_X25: u32 = 9;
    pub const LKL_AF_INET6: u32 = 10;
    pub const LKL_AF_ROSE: u32 = 11;
    pub const lkl_AF_DECnet: u32 = 12;
    pub const LKL_AF_NETBEUI: u32 = 13;
    pub const LKL_AF_SECURITY: u32 = 14;
    pub const LKL_AF_KEY: u32 = 15;
    pub const LKL_AF_NETLINK: u32 = 16;
    pub const LKL_AF_ROUTE: u32 = 16;
    pub const LKL_AF_PACKET: u32 = 17;
    pub const LKL_AF_ASH: u32 = 18;
    pub const LKL_AF_ECONET: u32 = 19;
    pub const LKL_AF_ATMSVC: u32 = 20;
    pub const LKL_AF_RDS: u32 = 21;
    pub const LKL_AF_SNA: u32 = 22;
    pub const LKL_AF_IRDA: u32 = 23;
    pub const LKL_AF_PPPOX: u32 = 24;
    pub const LKL_AF_WANPIPE: u32 = 25;
    pub const LKL_AF_LLC: u32 = 26;
    pub const LKL_AF_IB: u32 = 27;
    pub const LKL_AF_MPLS: u32 = 28;
    pub const LKL_AF_CAN: u32 = 29;
    pub const LKL_AF_TIPC: u32 = 30;
    pub const LKL_AF_BLUETOOTH: u32 = 31;
    pub const LKL_AF_IUCV: u32 = 32;
    pub const LKL_AF_RXRPC: u32 = 33;
    pub const LKL_AF_ISDN: u32 = 34;
    pub const LKL_AF_PHONET: u32 = 35;
    pub const LKL_AF_IEEE802154: u32 = 36;
    pub const LKL_AF_CAIF: u32 = 37;
    pub const LKL_AF_ALG: u32 = 38;
    pub const LKL_AF_NFC: u32 = 39;
    pub const LKL_AF_VSOCK: u32 = 40;
    pub const LKL_SOCK_STREAM: u32 = 1;
    pub const LKL_SOCK_DGRAM: u32 = 2;
    pub const LKL_SOCK_RAW: u32 = 3;
    pub const LKL_SOCK_RDM: u32 = 4;
    pub const LKL_SOCK_SEQPACKET: u32 = 5;
    pub const LKL_SOCK_DCCP: u32 = 6;
    pub const LKL_SOCK_PACKET: u32 = 10;
    pub const LKL_MSG_TRUNC: u32 = 32;
    pub const LKL_MSG_DONTWAIT: u32 = 64;
    pub type __lkl__s8 = ::std::os::raw::c_schar;
    pub type __lkl__u8 = ::std::os::raw::c_uchar;
    pub type __lkl__s16 = ::std::os::raw::c_short;
    pub type __lkl__u16 = ::std::os::raw::c_ushort;
    pub type __lkl__s32 = ::std::os::raw::c_int;
    pub type __lkl__u32 = ::std::os::raw::c_uint;
    pub type __lkl__s64 = ::std::os::raw::c_longlong;
    pub type __lkl__u64 = ::std::os::raw::c_ulonglong;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_fd_set {
        pub fds_bits: [::std::os::raw::c_ulong; 16usize],
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_fd_set() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_fd_set>(),
            128usize,
            concat!("Size of: ", stringify!(__lkl__kernel_fd_set))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_fd_set>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_fd_set))
        );
        fn test_field_fds_bits() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_fd_set>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_fd_set),
                    "::",
                    stringify!(fds_bits)
                )
            );
        }
        test_field_fds_bits();
    }
    pub type __lkl__kernel_sighandler_t =
        ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
    pub type __lkl__kernel_key_t = ::std::os::raw::c_int;
    pub type __lkl__kernel_mqd_t = ::std::os::raw::c_int;
    pub type __lkl__kernel_long_t = ::std::os::raw::c_long;
    pub type __lkl__kernel_ulong_t = ::std::os::raw::c_ulong;
    pub type __lkl__kernel_ino_t = __lkl__kernel_ulong_t;
    pub type __lkl__kernel_mode_t = ::std::os::raw::c_uint;
    pub type __lkl__kernel_pid_t = ::std::os::raw::c_int;
    pub type __lkl__kernel_ipc_pid_t = ::std::os::raw::c_int;
    pub type __lkl__kernel_uid_t = ::std::os::raw::c_uint;
    pub type __lkl__kernel_gid_t = ::std::os::raw::c_uint;
    pub type __lkl__kernel_suseconds_t = __lkl__kernel_long_t;
    pub type __lkl__kernel_daddr_t = ::std::os::raw::c_int;
    pub type __lkl__kernel_uid32_t = ::std::os::raw::c_uint;
    pub type __lkl__kernel_gid32_t = ::std::os::raw::c_uint;
    pub type __lkl__kernel_old_uid_t = __lkl__kernel_uid_t;
    pub type __lkl__kernel_old_gid_t = __lkl__kernel_gid_t;
    pub type __lkl__kernel_old_dev_t = ::std::os::raw::c_uint;
    pub type __lkl__kernel_size_t = __lkl__kernel_ulong_t;
    pub type __lkl__kernel_ssize_t = __lkl__kernel_long_t;
    pub type __lkl__kernel_ptrdiff_t = __lkl__kernel_long_t;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_fsid_t {
        pub val: [::std::os::raw::c_int; 2usize],
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_fsid_t() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_fsid_t>(),
            8usize,
            concat!("Size of: ", stringify!(__lkl__kernel_fsid_t))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_fsid_t>(),
            4usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_fsid_t))
        );
        fn test_field_val() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_fsid_t>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_fsid_t),
                    "::",
                    stringify!(val)
                )
            );
        }
        test_field_val();
    }
    pub type __lkl__kernel_off_t = __lkl__kernel_long_t;
    pub type __lkl__kernel_loff_t = ::std::os::raw::c_longlong;
    pub type __lkl__kernel_old_time_t = __lkl__kernel_long_t;
    pub type __lkl__kernel_time_t = __lkl__kernel_long_t;
    pub type __lkl__kernel_time64_t = ::std::os::raw::c_longlong;
    pub type __lkl__kernel_clock_t = __lkl__kernel_long_t;
    pub type __lkl__kernel_timer_t = ::std::os::raw::c_int;
    pub type __lkl__kernel_clockid_t = ::std::os::raw::c_int;
    pub type __lkl__kernel_caddr_t = *mut ::std::os::raw::c_char;
    pub type __lkl__kernel_uid16_t = ::std::os::raw::c_ushort;
    pub type __lkl__kernel_gid16_t = ::std::os::raw::c_ushort;
    pub type __lkl__le16 = __lkl__u16;
    pub type __lkl__be16 = __lkl__u16;
    pub type __lkl__le32 = __lkl__u32;
    pub type __lkl__be32 = __lkl__u32;
    pub type __lkl__le64 = __lkl__u64;
    pub type __lkl__be64 = __lkl__u64;
    pub type __lkl__sum16 = __lkl__u16;
    pub type __lkl__wsum = __lkl__u32;
    pub type __lkl__poll_t = ::std::os::raw::c_uint;
    pub type lkl_qid_t = __lkl__kernel_uid32_t;
    pub type lkl_fd_set = __lkl__kernel_fd_set;
    pub type lkl_mode_t = __lkl__kernel_mode_t;
    pub type lkl_umode_t = ::std::os::raw::c_ushort;
    pub type lkl_nlink_t = __lkl__u32;
    pub type lkl_off_t = __lkl__kernel_off_t;
    pub type lkl_pid_t = __lkl__kernel_pid_t;
    pub type lkl_key_t = __lkl__kernel_key_t;
    pub type lkl_suseconds_t = __lkl__kernel_suseconds_t;
    pub type lkl_timer_t = __lkl__kernel_timer_t;
    pub type lkl_clockid_t = __lkl__kernel_clockid_t;
    pub type lkl_mqd_t = __lkl__kernel_mqd_t;
    pub type lkl_uid_t = __lkl__kernel_uid32_t;
    pub type lkl_gid_t = __lkl__kernel_gid32_t;
    pub type lkl_uid16_t = __lkl__kernel_uid16_t;
    pub type lkl_gid16_t = __lkl__kernel_gid16_t;
    pub type lkl_uintptr_t = ::std::os::raw::c_ulong;
    pub type lkl_loff_t = __lkl__kernel_loff_t;
    pub type lkl_size_t = __lkl__kernel_size_t;
    pub type lkl_ssize_t = __lkl__kernel_ssize_t;
    pub type lkl_time_t = __lkl__kernel_time_t;
    pub type lkl_clock_t = __lkl__kernel_clock_t;
    pub type lkl_u32 = __lkl__u32;
    pub type lkl_s32 = __lkl__s32;
    pub type lkl_u64 = __lkl__u64;
    pub type lkl_s64 = __lkl__s64;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_timespec {
        pub tv_sec: __lkl__kernel_time64_t,
        pub tv_nsec: ::std::os::raw::c_longlong,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_timespec() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_timespec>(),
            16usize,
            concat!("Size of: ", stringify!(__lkl__kernel_timespec))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_timespec>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_timespec))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timespec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timespec),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timespec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timespec),
                    "::",
                    stringify!(tv_nsec)
                )
            );
        }
        test_field_tv_nsec();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_itimerspec {
        pub it_interval: __lkl__kernel_timespec,
        pub it_value: __lkl__kernel_timespec,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_itimerspec() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_itimerspec>(),
            32usize,
            concat!("Size of: ", stringify!(__lkl__kernel_itimerspec))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_itimerspec>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_itimerspec))
        );
        fn test_field_it_interval() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_itimerspec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_itimerspec),
                    "::",
                    stringify!(it_interval)
                )
            );
        }
        test_field_it_interval();
        fn test_field_it_value() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_itimerspec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_itimerspec),
                    "::",
                    stringify!(it_value)
                )
            );
        }
        test_field_it_value();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_old_timeval {
        pub tv_sec: __lkl__kernel_long_t,
        pub tv_usec: __lkl__kernel_long_t,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_old_timeval() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_old_timeval>(),
            16usize,
            concat!("Size of: ", stringify!(__lkl__kernel_old_timeval))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_old_timeval>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_old_timeval))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_old_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_old_timeval),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_usec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_old_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_old_timeval),
                    "::",
                    stringify!(tv_usec)
                )
            );
        }
        test_field_tv_usec();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_old_timespec {
        pub tv_sec: __lkl__kernel_old_time_t,
        pub tv_nsec: ::std::os::raw::c_long,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_old_timespec() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_old_timespec>(),
            16usize,
            concat!("Size of: ", stringify!(__lkl__kernel_old_timespec))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_old_timespec>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_old_timespec))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_old_timespec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_old_timespec),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_old_timespec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_old_timespec),
                    "::",
                    stringify!(tv_nsec)
                )
            );
        }
        test_field_tv_nsec();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_old_itimerval {
        pub it_interval: __lkl__kernel_old_timeval,
        pub it_value: __lkl__kernel_old_timeval,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_old_itimerval() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_old_itimerval>(),
            32usize,
            concat!("Size of: ", stringify!(__lkl__kernel_old_itimerval))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_old_itimerval>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_old_itimerval))
        );
        fn test_field_it_interval() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_old_itimerval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_old_itimerval),
                    "::",
                    stringify!(it_interval)
                )
            );
        }
        test_field_it_interval();
        fn test_field_it_value() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_old_itimerval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_old_itimerval),
                    "::",
                    stringify!(it_value)
                )
            );
        }
        test_field_it_value();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_sock_timeval {
        pub tv_sec: __lkl__s64,
        pub tv_usec: __lkl__s64,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_sock_timeval() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_sock_timeval>(),
            16usize,
            concat!("Size of: ", stringify!(__lkl__kernel_sock_timeval))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_sock_timeval>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_sock_timeval))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_sock_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_sock_timeval),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_usec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_sock_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_sock_timeval),
                    "::",
                    stringify!(tv_usec)
                )
            );
        }
        test_field_tv_usec();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_timespec {
        pub tv_sec: __lkl__kernel_old_time_t,
        pub tv_nsec: ::std::os::raw::c_long,
    }
    #[test]
    fn bindgen_test_layout_lkl_timespec() {
        assert_eq!(
            ::std::mem::size_of::<lkl_timespec>(),
            16usize,
            concat!("Size of: ", stringify!(lkl_timespec))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_timespec>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_timespec))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timespec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timespec),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timespec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timespec),
                    "::",
                    stringify!(tv_nsec)
                )
            );
        }
        test_field_tv_nsec();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_timeval {
        pub tv_sec: __lkl__kernel_old_time_t,
        pub tv_usec: __lkl__kernel_suseconds_t,
    }
    #[test]
    fn bindgen_test_layout_lkl_timeval() {
        assert_eq!(
            ::std::mem::size_of::<lkl_timeval>(),
            16usize,
            concat!("Size of: ", stringify!(lkl_timeval))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_timeval>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_timeval))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timeval),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_usec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timeval),
                    "::",
                    stringify!(tv_usec)
                )
            );
        }
        test_field_tv_usec();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_itimerspec {
        pub it_interval: lkl_timespec,
        pub it_value: lkl_timespec,
    }
    #[test]
    fn bindgen_test_layout_lkl_itimerspec() {
        assert_eq!(
            ::std::mem::size_of::<lkl_itimerspec>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_itimerspec))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_itimerspec>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_itimerspec))
        );
        fn test_field_it_interval() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_itimerspec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_itimerspec),
                    "::",
                    stringify!(it_interval)
                )
            );
        }
        test_field_it_interval();
        fn test_field_it_value() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_itimerspec>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_itimerspec),
                    "::",
                    stringify!(it_value)
                )
            );
        }
        test_field_it_value();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_itimerval {
        pub it_interval: lkl_timeval,
        pub it_value: lkl_timeval,
    }
    #[test]
    fn bindgen_test_layout_lkl_itimerval() {
        assert_eq!(
            ::std::mem::size_of::<lkl_itimerval>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_itimerval))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_itimerval>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_itimerval))
        );
        fn test_field_it_interval() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_itimerval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_itimerval),
                    "::",
                    stringify!(it_interval)
                )
            );
        }
        test_field_it_interval();
        fn test_field_it_value() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_itimerval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_itimerval),
                    "::",
                    stringify!(it_value)
                )
            );
        }
        test_field_it_value();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_timezone {
        pub tz_minuteswest: ::std::os::raw::c_int,
        pub tz_dsttime: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_lkl_timezone() {
        assert_eq!(
            ::std::mem::size_of::<lkl_timezone>(),
            8usize,
            concat!("Size of: ", stringify!(lkl_timezone))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_timezone>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_timezone))
        );
        fn test_field_tz_minuteswest() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timezone>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timezone),
                    "::",
                    stringify!(tz_minuteswest)
                )
            );
        }
        test_field_tz_minuteswest();
        fn test_field_tz_dsttime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timezone>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timezone),
                    "::",
                    stringify!(tz_dsttime)
                )
            );
        }
        test_field_tz_dsttime();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_tms {
        pub tms_utime: __lkl__kernel_clock_t,
        pub tms_stime: __lkl__kernel_clock_t,
        pub tms_cutime: __lkl__kernel_clock_t,
        pub tms_cstime: __lkl__kernel_clock_t,
    }
    #[test]
    fn bindgen_test_layout_lkl_tms() {
        assert_eq!(
            ::std::mem::size_of::<lkl_tms>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_tms))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_tms>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_tms))
        );
        fn test_field_tms_utime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_tms>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tms_utime) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_tms),
                    "::",
                    stringify!(tms_utime)
                )
            );
        }
        test_field_tms_utime();
        fn test_field_tms_stime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_tms>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tms_stime) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_tms),
                    "::",
                    stringify!(tms_stime)
                )
            );
        }
        test_field_tms_stime();
        fn test_field_tms_cutime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_tms>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tms_cutime) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_tms),
                    "::",
                    stringify!(tms_cutime)
                )
            );
        }
        test_field_tms_cutime();
        fn test_field_tms_cstime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_tms>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tms_cstime) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_tms),
                    "::",
                    stringify!(tms_cstime)
                )
            );
        }
        test_field_tms_cstime();
    }
    /*
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_timex {
        pub modes: ::std::os::raw::c_uint,
        pub offset: __lkl__kernel_long_t,
        pub freq: __lkl__kernel_long_t,
        pub maxerror: __lkl__kernel_long_t,
        pub esterror: __lkl__kernel_long_t,
        pub status: ::std::os::raw::c_int,
        pub constant: __lkl__kernel_long_t,
        pub precision: __lkl__kernel_long_t,
        pub tolerance: __lkl__kernel_long_t,
        pub time: lkl_timeval,
        pub tick: __lkl__kernel_long_t,
        pub ppsfreq: __lkl__kernel_long_t,
        pub jitter: __lkl__kernel_long_t,
        pub shift: ::std::os::raw::c_int,
        pub stabil: __lkl__kernel_long_t,
        pub jitcnt: __lkl__kernel_long_t,
        pub calcnt: __lkl__kernel_long_t,
        pub errcnt: __lkl__kernel_long_t,
        pub stbcnt: __lkl__kernel_long_t,
        pub tai: ::std::os::raw::c_int,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 44usize]>,
    }
    #[test]
    fn bindgen_test_layout_lkl_timex() {
        assert_eq!(
            ::std::mem::size_of::<lkl_timex>(),
            208usize,
            concat!("Size of: ", stringify!(lkl_timex))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_timex>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_timex))
        );
        fn test_field_modes() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).modes) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(modes)
                )
            );
        }
        test_field_modes();
        fn test_field_offset() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(offset)
                )
            );
        }
        test_field_offset();
        fn test_field_freq() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).freq) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(freq)
                )
            );
        }
        test_field_freq();
        fn test_field_maxerror() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).maxerror) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(maxerror)
                )
            );
        }
        test_field_maxerror();
        fn test_field_esterror() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).esterror) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(esterror)
                )
            );
        }
        test_field_esterror();
        fn test_field_status() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(status)
                )
            );
        }
        test_field_status();
        fn test_field_constant() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).constant) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(constant)
                )
            );
        }
        test_field_constant();
        fn test_field_precision() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).precision) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(precision)
                )
            );
        }
        test_field_precision();
        fn test_field_tolerance() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tolerance) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(tolerance)
                )
            );
        }
        test_field_tolerance();
        fn test_field_time() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(time)
                )
            );
        }
        test_field_time();
        fn test_field_tick() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tick) as usize - ptr as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(tick)
                )
            );
        }
        test_field_tick();
        fn test_field_ppsfreq() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).ppsfreq) as usize - ptr as usize
                },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(ppsfreq)
                )
            );
        }
        test_field_ppsfreq();
        fn test_field_jitter() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).jitter) as usize - ptr as usize
                },
                104usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(jitter)
                )
            );
        }
        test_field_jitter();
        fn test_field_shift() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).shift) as usize - ptr as usize
                },
                112usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(shift)
                )
            );
        }
        test_field_shift();
        fn test_field_stabil() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stabil) as usize - ptr as usize
                },
                120usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(stabil)
                )
            );
        }
        test_field_stabil();
        fn test_field_jitcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).jitcnt) as usize - ptr as usize
                },
                128usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(jitcnt)
                )
            );
        }
        test_field_jitcnt();
        fn test_field_calcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).calcnt) as usize - ptr as usize
                },
                136usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(calcnt)
                )
            );
        }
        test_field_calcnt();
        fn test_field_errcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).errcnt) as usize - ptr as usize
                },
                144usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(errcnt)
                )
            );
        }
        test_field_errcnt();
        fn test_field_stbcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stbcnt) as usize - ptr as usize
                },
                152usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(stbcnt)
                )
            );
        }
        test_field_stbcnt();
        fn test_field_tai() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tai) as usize - ptr as usize
                },
                160usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_timex),
                    "::",
                    stringify!(tai)
                )
            );
        }
        test_field_tai();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_timex_timeval {
        pub tv_sec: __lkl__kernel_time64_t,
        pub tv_usec: ::std::os::raw::c_longlong,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_timex_timeval() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_timex_timeval>(),
            16usize,
            concat!("Size of: ", stringify!(__lkl__kernel_timex_timeval))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_timex_timeval>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_timex_timeval))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex_timeval),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_usec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex_timeval>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex_timeval),
                    "::",
                    stringify!(tv_usec)
                )
            );
        }
        test_field_tv_usec();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__kernel_timex {
        pub modes: ::std::os::raw::c_uint,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
        pub offset: ::std::os::raw::c_longlong,
        pub freq: ::std::os::raw::c_longlong,
        pub maxerror: ::std::os::raw::c_longlong,
        pub esterror: ::std::os::raw::c_longlong,
        pub status: ::std::os::raw::c_int,
        pub _bitfield_align_2: [u8; 0],
        pub _bitfield_2: __BindgenBitfieldUnit<[u8; 4usize]>,
        pub constant: ::std::os::raw::c_longlong,
        pub precision: ::std::os::raw::c_longlong,
        pub tolerance: ::std::os::raw::c_longlong,
        pub time: __lkl__kernel_timex_timeval,
        pub tick: ::std::os::raw::c_longlong,
        pub ppsfreq: ::std::os::raw::c_longlong,
        pub jitter: ::std::os::raw::c_longlong,
        pub shift: ::std::os::raw::c_int,
        pub _bitfield_align_3: [u8; 0],
        pub _bitfield_3: __BindgenBitfieldUnit<[u8; 4usize]>,
        pub stabil: ::std::os::raw::c_longlong,
        pub jitcnt: ::std::os::raw::c_longlong,
        pub calcnt: ::std::os::raw::c_longlong,
        pub errcnt: ::std::os::raw::c_longlong,
        pub stbcnt: ::std::os::raw::c_longlong,
        pub tai: ::std::os::raw::c_int,
        pub _bitfield_align_4: [u8; 0],
        pub _bitfield_4: __BindgenBitfieldUnit<[u8; 44usize]>,
    }
    #[test]
    fn bindgen_test_layout___lkl__kernel_timex() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__kernel_timex>(),
            208usize,
            concat!("Size of: ", stringify!(__lkl__kernel_timex))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__kernel_timex>(),
            8usize,
            concat!("Alignment of ", stringify!(__lkl__kernel_timex))
        );
        fn test_field_modes() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).modes) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(modes)
                )
            );
        }
        test_field_modes();
        fn test_field_offset() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(offset)
                )
            );
        }
        test_field_offset();
        fn test_field_freq() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).freq) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(freq)
                )
            );
        }
        test_field_freq();
        fn test_field_maxerror() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).maxerror) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(maxerror)
                )
            );
        }
        test_field_maxerror();
        fn test_field_esterror() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).esterror) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(esterror)
                )
            );
        }
        test_field_esterror();
        fn test_field_status() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(status)
                )
            );
        }
        test_field_status();
        fn test_field_constant() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).constant) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(constant)
                )
            );
        }
        test_field_constant();
        fn test_field_precision() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).precision) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(precision)
                )
            );
        }
        test_field_precision();
        fn test_field_tolerance() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tolerance) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(tolerance)
                )
            );
        }
        test_field_tolerance();
        fn test_field_time() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(time)
                )
            );
        }
        test_field_time();
        fn test_field_tick() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tick) as usize - ptr as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(tick)
                )
            );
        }
        test_field_tick();
        fn test_field_ppsfreq() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).ppsfreq) as usize - ptr as usize
                },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(ppsfreq)
                )
            );
        }
        test_field_ppsfreq();
        fn test_field_jitter() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).jitter) as usize - ptr as usize
                },
                104usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(jitter)
                )
            );
        }
        test_field_jitter();
        fn test_field_shift() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).shift) as usize - ptr as usize
                },
                112usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(shift)
                )
            );
        }
        test_field_shift();
        fn test_field_stabil() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stabil) as usize - ptr as usize
                },
                120usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(stabil)
                )
            );
        }
        test_field_stabil();
        fn test_field_jitcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).jitcnt) as usize - ptr as usize
                },
                128usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(jitcnt)
                )
            );
        }
        test_field_jitcnt();
        fn test_field_calcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).calcnt) as usize - ptr as usize
                },
                136usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(calcnt)
                )
            );
        }
        test_field_calcnt();
        fn test_field_errcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).errcnt) as usize - ptr as usize
                },
                144usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(errcnt)
                )
            );
        }
        test_field_errcnt();
        fn test_field_stbcnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stbcnt) as usize - ptr as usize
                },
                152usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(stbcnt)
                )
            );
        }
        test_field_stbcnt();
        fn test_field_tai() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__kernel_timex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tai) as usize - ptr as usize
                },
                160usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__kernel_timex),
                    "::",
                    stringify!(tai)
                )
            );
        }
        test_field_tai();
    }
    impl __lkl__kernel_timex {
        #[inline]
        pub fn new_bitfield_1() -> __BindgenBitfieldUnit<[u8; 4usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
            __bindgen_bitfield_unit
        }
        #[inline]
        pub fn new_bitfield_2() -> __BindgenBitfieldUnit<[u8; 4usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
            __bindgen_bitfield_unit
        }
        #[inline]
        pub fn new_bitfield_3() -> __BindgenBitfieldUnit<[u8; 4usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
            __bindgen_bitfield_unit
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__user_cap_header_struct {
        pub version: __lkl__u32,
        pub pid: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout___lkl__user_cap_header_struct() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__user_cap_header_struct>(),
            8usize,
            concat!("Size of: ", stringify!(__lkl__user_cap_header_struct))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__user_cap_header_struct>(),
            4usize,
            concat!("Alignment of ", stringify!(__lkl__user_cap_header_struct))
        );
        fn test_field_version() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__user_cap_header_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__user_cap_header_struct),
                    "::",
                    stringify!(version)
                )
            );
        }
        test_field_version();
        fn test_field_pid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__user_cap_header_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__user_cap_header_struct),
                    "::",
                    stringify!(pid)
                )
            );
        }
        test_field_pid();
    }
    pub type lkl_cap_user_header_t = *mut __lkl__user_cap_header_struct;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __lkl__user_cap_data_struct {
        pub effective: __lkl__u32,
        pub permitted: __lkl__u32,
        pub inheritable: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout___lkl__user_cap_data_struct() {
        assert_eq!(
            ::std::mem::size_of::<__lkl__user_cap_data_struct>(),
            12usize,
            concat!("Size of: ", stringify!(__lkl__user_cap_data_struct))
        );
        assert_eq!(
            ::std::mem::align_of::<__lkl__user_cap_data_struct>(),
            4usize,
            concat!("Alignment of ", stringify!(__lkl__user_cap_data_struct))
        );
        fn test_field_effective() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__user_cap_data_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).effective) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__user_cap_data_struct),
                    "::",
                    stringify!(effective)
                )
            );
        }
        test_field_effective();
        fn test_field_permitted() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__user_cap_data_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).permitted) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__user_cap_data_struct),
                    "::",
                    stringify!(permitted)
                )
            );
        }
        test_field_permitted();
        fn test_field_inheritable() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<__lkl__user_cap_data_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).inheritable) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__lkl__user_cap_data_struct),
                    "::",
                    stringify!(inheritable)
                )
            );
        }
        test_field_inheritable();
    }
    pub type lkl_cap_user_data_t = *mut __lkl__user_cap_data_struct;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_vfs_cap_data {
        pub magic_etc: __lkl__le32,
        pub data: [lkl_vfs_cap_data__bindgen_ty_1; 2usize],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_vfs_cap_data__bindgen_ty_1 {
        pub permitted: __lkl__le32,
        pub inheritable: __lkl__le32,
    }
    #[test]
    fn bindgen_test_layout_lkl_vfs_cap_data__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_vfs_cap_data__bindgen_ty_1>(),
            8usize,
            concat!("Size of: ", stringify!(lkl_vfs_cap_data__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_vfs_cap_data__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_vfs_cap_data__bindgen_ty_1))
        );
        fn test_field_permitted() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_cap_data__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).permitted) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_cap_data__bindgen_ty_1),
                    "::",
                    stringify!(permitted)
                )
            );
        }
        test_field_permitted();
        fn test_field_inheritable() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_cap_data__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).inheritable) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_cap_data__bindgen_ty_1),
                    "::",
                    stringify!(inheritable)
                )
            );
        }
        test_field_inheritable();
    }
    #[test]
    fn bindgen_test_layout_lkl_vfs_cap_data() {
        assert_eq!(
            ::std::mem::size_of::<lkl_vfs_cap_data>(),
            20usize,
            concat!("Size of: ", stringify!(lkl_vfs_cap_data))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_vfs_cap_data>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_vfs_cap_data))
        );
        fn test_field_magic_etc() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_cap_data>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).magic_etc) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_cap_data),
                    "::",
                    stringify!(magic_etc)
                )
            );
        }
        test_field_magic_etc();
        fn test_field_data() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_cap_data>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_cap_data),
                    "::",
                    stringify!(data)
                )
            );
        }
        test_field_data();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_vfs_ns_cap_data {
        pub magic_etc: __lkl__le32,
        pub data: [lkl_vfs_ns_cap_data__bindgen_ty_1; 2usize],
        pub rootid: __lkl__le32,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_vfs_ns_cap_data__bindgen_ty_1 {
        pub permitted: __lkl__le32,
        pub inheritable: __lkl__le32,
    }
    #[test]
    fn bindgen_test_layout_lkl_vfs_ns_cap_data__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_vfs_ns_cap_data__bindgen_ty_1>(),
            8usize,
            concat!("Size of: ", stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_vfs_ns_cap_data__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1)
            )
        );
        fn test_field_permitted() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_ns_cap_data__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).permitted) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1),
                    "::",
                    stringify!(permitted)
                )
            );
        }
        test_field_permitted();
        fn test_field_inheritable() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_ns_cap_data__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).inheritable) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1),
                    "::",
                    stringify!(inheritable)
                )
            );
        }
        test_field_inheritable();
    }
    #[test]
    fn bindgen_test_layout_lkl_vfs_ns_cap_data() {
        assert_eq!(
            ::std::mem::size_of::<lkl_vfs_ns_cap_data>(),
            24usize,
            concat!("Size of: ", stringify!(lkl_vfs_ns_cap_data))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_vfs_ns_cap_data>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_vfs_ns_cap_data))
        );
        fn test_field_magic_etc() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_ns_cap_data>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).magic_etc) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_ns_cap_data),
                    "::",
                    stringify!(magic_etc)
                )
            );
        }
        test_field_magic_etc();
        fn test_field_data() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_ns_cap_data>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_ns_cap_data),
                    "::",
                    stringify!(data)
                )
            );
        }
        test_field_data();
        fn test_field_rootid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_vfs_ns_cap_data>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).rootid) as usize - ptr as usize
                },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_vfs_ns_cap_data),
                    "::",
                    stringify!(rootid)
                )
            );
        }
        test_field_rootid();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_statx_timestamp {
        pub tv_sec: __lkl__s64,
        pub tv_nsec: __lkl__u32,
        pub __reserved: __lkl__s32,
    }
    #[test]
    fn bindgen_test_layout_lkl_statx_timestamp() {
        assert_eq!(
            ::std::mem::size_of::<lkl_statx_timestamp>(),
            16usize,
            concat!("Size of: ", stringify!(lkl_statx_timestamp))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_statx_timestamp>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_statx_timestamp))
        );
        fn test_field_tv_sec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx_timestamp>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx_timestamp),
                    "::",
                    stringify!(tv_sec)
                )
            );
        }
        test_field_tv_sec();
        fn test_field_tv_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx_timestamp>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx_timestamp),
                    "::",
                    stringify!(tv_nsec)
                )
            );
        }
        test_field_tv_nsec();
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx_timestamp>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                12usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx_timestamp),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_statx {
        pub stx_mask: __lkl__u32,
        pub stx_blksize: __lkl__u32,
        pub stx_attributes: __lkl__u64,
        pub stx_nlink: __lkl__u32,
        pub stx_uid: __lkl__u32,
        pub stx_gid: __lkl__u32,
        pub stx_mode: __lkl__u16,
        pub __spare0: [__lkl__u16; 1usize],
        pub stx_ino: __lkl__u64,
        pub stx_size: __lkl__u64,
        pub stx_blocks: __lkl__u64,
        pub stx_attributes_mask: __lkl__u64,
        pub stx_atime: lkl_statx_timestamp,
        pub stx_btime: lkl_statx_timestamp,
        pub stx_ctime: lkl_statx_timestamp,
        pub stx_mtime: lkl_statx_timestamp,
        pub stx_rdev_major: __lkl__u32,
        pub stx_rdev_minor: __lkl__u32,
        pub stx_dev_major: __lkl__u32,
        pub stx_dev_minor: __lkl__u32,
        pub stx_mnt_id: __lkl__u64,
        pub __spare2: __lkl__u64,
        pub __spare3: [__lkl__u64; 12usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_statx() {
        assert_eq!(
            ::std::mem::size_of::<lkl_statx>(),
            256usize,
            concat!("Size of: ", stringify!(lkl_statx))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_statx>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_statx))
        );
        fn test_field_stx_mask() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_mask) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_mask)
                )
            );
        }
        test_field_stx_mask();
        fn test_field_stx_blksize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_blksize) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_blksize)
                )
            );
        }
        test_field_stx_blksize();
        fn test_field_stx_attributes() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_attributes) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_attributes)
                )
            );
        }
        test_field_stx_attributes();
        fn test_field_stx_nlink() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_nlink) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_nlink)
                )
            );
        }
        test_field_stx_nlink();
        fn test_field_stx_uid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_uid) as usize - ptr as usize
                },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_uid)
                )
            );
        }
        test_field_stx_uid();
        fn test_field_stx_gid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_gid) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_gid)
                )
            );
        }
        test_field_stx_gid();
        fn test_field_stx_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_mode) as usize - ptr as usize
                },
                28usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_mode)
                )
            );
        }
        test_field_stx_mode();
        fn test_field___spare0() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__spare0) as usize - ptr as usize
                },
                30usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(__spare0)
                )
            );
        }
        test_field___spare0();
        fn test_field_stx_ino() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_ino) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_ino)
                )
            );
        }
        test_field_stx_ino();
        fn test_field_stx_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_size) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_size)
                )
            );
        }
        test_field_stx_size();
        fn test_field_stx_blocks() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_blocks) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_blocks)
                )
            );
        }
        test_field_stx_blocks();
        fn test_field_stx_attributes_mask() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_attributes_mask) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_attributes_mask)
                )
            );
        }
        test_field_stx_attributes_mask();
        fn test_field_stx_atime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_atime) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_atime)
                )
            );
        }
        test_field_stx_atime();
        fn test_field_stx_btime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_btime) as usize - ptr as usize
                },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_btime)
                )
            );
        }
        test_field_stx_btime();
        fn test_field_stx_ctime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_ctime) as usize - ptr as usize
                },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_ctime)
                )
            );
        }
        test_field_stx_ctime();
        fn test_field_stx_mtime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_mtime) as usize - ptr as usize
                },
                112usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_mtime)
                )
            );
        }
        test_field_stx_mtime();
        fn test_field_stx_rdev_major() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_rdev_major) as usize - ptr as usize
                },
                128usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_rdev_major)
                )
            );
        }
        test_field_stx_rdev_major();
        fn test_field_stx_rdev_minor() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_rdev_minor) as usize - ptr as usize
                },
                132usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_rdev_minor)
                )
            );
        }
        test_field_stx_rdev_minor();
        fn test_field_stx_dev_major() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_dev_major) as usize - ptr as usize
                },
                136usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_dev_major)
                )
            );
        }
        test_field_stx_dev_major();
        fn test_field_stx_dev_minor() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_dev_minor) as usize - ptr as usize
                },
                140usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_dev_minor)
                )
            );
        }
        test_field_stx_dev_minor();
        fn test_field_stx_mnt_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).stx_mnt_id) as usize - ptr as usize
                },
                144usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(stx_mnt_id)
                )
            );
        }
        test_field_stx_mnt_id();
        fn test_field___spare2() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__spare2) as usize - ptr as usize
                },
                152usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(__spare2)
                )
            );
        }
        test_field___spare2();
        fn test_field___spare3() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statx>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__spare3) as usize - ptr as usize
                },
                160usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statx),
                    "::",
                    stringify!(__spare3)
                )
            );
        }
        test_field___spare3();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_f_owner_ex {
        pub type_: ::std::os::raw::c_int,
        pub pid: __lkl__kernel_pid_t,
    }
    #[test]
    fn bindgen_test_layout_lkl_f_owner_ex() {
        assert_eq!(
            ::std::mem::size_of::<lkl_f_owner_ex>(),
            8usize,
            concat!("Size of: ", stringify!(lkl_f_owner_ex))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_f_owner_ex>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_f_owner_ex))
        );
        fn test_field_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_f_owner_ex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_f_owner_ex),
                    "::",
                    stringify!(type_)
                )
            );
        }
        test_field_type();
        fn test_field_pid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_f_owner_ex>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_f_owner_ex),
                    "::",
                    stringify!(pid)
                )
            );
        }
        test_field_pid();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_flock {
        pub l_type: ::std::os::raw::c_short,
        pub l_whence: ::std::os::raw::c_short,
        pub l_start: __lkl__kernel_off_t,
        pub l_len: __lkl__kernel_off_t,
        pub l_pid: __lkl__kernel_pid_t,
    }
    #[test]
    fn bindgen_test_layout_lkl_flock() {
        assert_eq!(
            ::std::mem::size_of::<lkl_flock>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_flock))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_flock>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_flock))
        );
        fn test_field_l_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock),
                    "::",
                    stringify!(l_type)
                )
            );
        }
        test_field_l_type();
        fn test_field_l_whence() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize
                },
                2usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock),
                    "::",
                    stringify!(l_whence)
                )
            );
        }
        test_field_l_whence();
        fn test_field_l_start() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock),
                    "::",
                    stringify!(l_start)
                )
            );
        }
        test_field_l_start();
        fn test_field_l_len() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock),
                    "::",
                    stringify!(l_len)
                )
            );
        }
        test_field_l_len();
        fn test_field_l_pid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock),
                    "::",
                    stringify!(l_pid)
                )
            );
        }
        test_field_l_pid();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_flock64 {
        pub l_type: ::std::os::raw::c_short,
        pub l_whence: ::std::os::raw::c_short,
        pub l_start: __lkl__kernel_loff_t,
        pub l_len: __lkl__kernel_loff_t,
        pub l_pid: __lkl__kernel_pid_t,
    }
    #[test]
    fn bindgen_test_layout_lkl_flock64() {
        assert_eq!(
            ::std::mem::size_of::<lkl_flock64>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_flock64))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_flock64>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_flock64))
        );
        fn test_field_l_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock64),
                    "::",
                    stringify!(l_type)
                )
            );
        }
        test_field_l_type();
        fn test_field_l_whence() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize
                },
                2usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock64),
                    "::",
                    stringify!(l_whence)
                )
            );
        }
        test_field_l_whence();
        fn test_field_l_start() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock64),
                    "::",
                    stringify!(l_start)
                )
            );
        }
        test_field_l_start();
        fn test_field_l_len() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock64),
                    "::",
                    stringify!(l_len)
                )
            );
        }
        test_field_l_len();
        fn test_field_l_pid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_flock64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_flock64),
                    "::",
                    stringify!(l_pid)
                )
            );
        }
        test_field_l_pid();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_open_how {
        pub flags: __lkl__u64,
        pub mode: __lkl__u64,
        pub resolve: __lkl__u64,
    }
    #[test]
    fn bindgen_test_layout_lkl_open_how() {
        assert_eq!(
            ::std::mem::size_of::<lkl_open_how>(),
            24usize,
            concat!("Size of: ", stringify!(lkl_open_how))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_open_how>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_open_how))
        );
        fn test_field_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_open_how>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_open_how),
                    "::",
                    stringify!(flags)
                )
            );
        }
        test_field_flags();
        fn test_field_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_open_how>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_open_how),
                    "::",
                    stringify!(mode)
                )
            );
        }
        test_field_mode();
        fn test_field_resolve() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_open_how>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).resolve) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_open_how),
                    "::",
                    stringify!(resolve)
                )
            );
        }
        test_field_resolve();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_fscrypt_policy_v1 {
        pub version: __lkl__u8,
        pub contents_encryption_mode: __lkl__u8,
        pub filenames_encryption_mode: __lkl__u8,
        pub flags: __lkl__u8,
        pub master_key_descriptor: [__lkl__u8; 8usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_policy_v1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_policy_v1>(),
            12usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_policy_v1))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_policy_v1>(),
            1usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_policy_v1))
        );
        fn test_field_version() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v1),
                    "::",
                    stringify!(version)
                )
            );
        }
        test_field_version();
        fn test_field_contents_encryption_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).contents_encryption_mode) as usize - ptr as usize
                },
                1usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v1),
                    "::",
                    stringify!(contents_encryption_mode)
                )
            );
        }
        test_field_contents_encryption_mode();
        fn test_field_filenames_encryption_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).filenames_encryption_mode) as usize - ptr as usize
                },
                2usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v1),
                    "::",
                    stringify!(filenames_encryption_mode)
                )
            );
        }
        test_field_filenames_encryption_mode();
        fn test_field_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
                },
                3usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v1),
                    "::",
                    stringify!(flags)
                )
            );
        }
        test_field_flags();
        fn test_field_master_key_descriptor() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).master_key_descriptor) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v1),
                    "::",
                    stringify!(master_key_descriptor)
                )
            );
        }
        test_field_master_key_descriptor();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_fscrypt_key {
        pub mode: __lkl__u32,
        pub raw: [__lkl__u8; 64usize],
        pub size: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_key() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_key>(),
            72usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_key))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_key>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_key))
        );
        fn test_field_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_key>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key),
                    "::",
                    stringify!(mode)
                )
            );
        }
        test_field_mode();
        fn test_field_raw() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_key>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).raw) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key),
                    "::",
                    stringify!(raw)
                )
            );
        }
        test_field_raw();
        fn test_field_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_key>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
                },
                68usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key),
                    "::",
                    stringify!(size)
                )
            );
        }
        test_field_size();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_fscrypt_policy_v2 {
        pub version: __lkl__u8,
        pub contents_encryption_mode: __lkl__u8,
        pub filenames_encryption_mode: __lkl__u8,
        pub flags: __lkl__u8,
        pub __reserved: [__lkl__u8; 4usize],
        pub master_key_identifier: [__lkl__u8; 16usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_policy_v2() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_policy_v2>(),
            24usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_policy_v2))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_policy_v2>(),
            1usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_policy_v2))
        );
        fn test_field_version() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v2),
                    "::",
                    stringify!(version)
                )
            );
        }
        test_field_version();
        fn test_field_contents_encryption_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).contents_encryption_mode) as usize - ptr as usize
                },
                1usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v2),
                    "::",
                    stringify!(contents_encryption_mode)
                )
            );
        }
        test_field_contents_encryption_mode();
        fn test_field_filenames_encryption_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).filenames_encryption_mode) as usize - ptr as usize
                },
                2usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v2),
                    "::",
                    stringify!(filenames_encryption_mode)
                )
            );
        }
        test_field_filenames_encryption_mode();
        fn test_field_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
                },
                3usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v2),
                    "::",
                    stringify!(flags)
                )
            );
        }
        test_field_flags();
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v2),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
        fn test_field_master_key_identifier() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_policy_v2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).master_key_identifier) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_policy_v2),
                    "::",
                    stringify!(master_key_identifier)
                )
            );
        }
        test_field_master_key_identifier();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct lkl_fscrypt_get_policy_ex_arg {
        pub policy_size: __lkl__u64,
        pub policy: lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1 {
        pub version: __lkl__u8,
        pub v1: lkl_fscrypt_policy_v1,
        pub v2: lkl_fscrypt_policy_v2,
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>(),
            24usize,
            concat!(
                "Size of: ",
                stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>(),
            1usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1)
            )
        );
        fn test_field_version() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>::uninit(
                        );
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1),
                    "::",
                    stringify!(version)
                )
            );
        }
        test_field_version();
        fn test_field_v1() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>::uninit(
                        );
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).v1) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1),
                    "::",
                    stringify!(v1)
                )
            );
        }
        test_field_v1();
        fn test_field_v2() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>::uninit(
                        );
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).v2) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1),
                    "::",
                    stringify!(v2)
                )
            );
        }
        test_field_v2();
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_get_policy_ex_arg() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_get_policy_ex_arg>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_get_policy_ex_arg))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_get_policy_ex_arg>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_get_policy_ex_arg))
        );
        fn test_field_policy_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_policy_ex_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).policy_size) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_policy_ex_arg),
                    "::",
                    stringify!(policy_size)
                )
            );
        }
        test_field_policy_size();
        fn test_field_policy() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_policy_ex_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).policy) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_policy_ex_arg),
                    "::",
                    stringify!(policy)
                )
            );
        }
        test_field_policy();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct lkl_fscrypt_key_specifier {
        pub type_: __lkl__u32,
        pub __reserved: __lkl__u32,
        pub u: lkl_fscrypt_key_specifier__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union lkl_fscrypt_key_specifier__bindgen_ty_1 {
        pub __reserved: [__lkl__u8; 32usize],
        pub descriptor: [__lkl__u8; 8usize],
        pub identifier: [__lkl__u8; 16usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_key_specifier__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_key_specifier__bindgen_ty_1>(),
            32usize,
            concat!(
                "Size of: ",
                stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_key_specifier__bindgen_ty_1>(),
            1usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1)
            )
        );
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_key_specifier__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
        fn test_field_descriptor() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_key_specifier__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).descriptor) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1),
                    "::",
                    stringify!(descriptor)
                )
            );
        }
        test_field_descriptor();
        fn test_field_identifier() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_key_specifier__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).identifier) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1),
                    "::",
                    stringify!(identifier)
                )
            );
        }
        test_field_identifier();
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_key_specifier() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_key_specifier>(),
            40usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_key_specifier))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_key_specifier>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_key_specifier))
        );
        fn test_field_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_key_specifier>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key_specifier),
                    "::",
                    stringify!(type_)
                )
            );
        }
        test_field_type();
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_key_specifier>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key_specifier),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
        fn test_field_u() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_key_specifier>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_key_specifier),
                    "::",
                    stringify!(u)
                )
            );
        }
        test_field_u();
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct lkl_fscrypt_provisioning_key_payload {
        pub type_: __lkl__u32,
        pub __reserved: __lkl__u32,
        pub raw: __IncompleteArrayField<__lkl__u8>,
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_provisioning_key_payload() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_provisioning_key_payload>(),
            8usize,
            concat!(
                "Size of: ",
                stringify!(lkl_fscrypt_provisioning_key_payload)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_provisioning_key_payload>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_fscrypt_provisioning_key_payload)
            )
        );
        fn test_field_type() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_provisioning_key_payload>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_provisioning_key_payload),
                    "::",
                    stringify!(type_)
                )
            );
        }
        test_field_type();
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_provisioning_key_payload>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_provisioning_key_payload),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
        fn test_field_raw() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_fscrypt_provisioning_key_payload>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).raw) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_provisioning_key_payload),
                    "::",
                    stringify!(raw)
                )
            );
        }
        test_field_raw();
    }
    #[repr(C)]
    pub struct lkl_fscrypt_add_key_arg {
        pub key_spec: lkl_fscrypt_key_specifier,
        pub raw_size: __lkl__u32,
        pub key_id: __lkl__u32,
        pub __reserved: [__lkl__u32; 8usize],
        pub raw: __IncompleteArrayField<__lkl__u8>,
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_add_key_arg() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_add_key_arg>(),
            80usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_add_key_arg))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_add_key_arg>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_add_key_arg))
        );
        fn test_field_key_spec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_add_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).key_spec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_add_key_arg),
                    "::",
                    stringify!(key_spec)
                )
            );
        }
        test_field_key_spec();
        fn test_field_raw_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_add_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).raw_size) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_add_key_arg),
                    "::",
                    stringify!(raw_size)
                )
            );
        }
        test_field_raw_size();
        fn test_field_key_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_add_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).key_id) as usize - ptr as usize
                },
                44usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_add_key_arg),
                    "::",
                    stringify!(key_id)
                )
            );
        }
        test_field_key_id();
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_add_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_add_key_arg),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
        fn test_field_raw() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_add_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).raw) as usize - ptr as usize
                },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_add_key_arg),
                    "::",
                    stringify!(raw)
                )
            );
        }
        test_field_raw();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct lkl_fscrypt_remove_key_arg {
        pub key_spec: lkl_fscrypt_key_specifier,
        pub removal_status_flags: __lkl__u32,
        pub __reserved: [__lkl__u32; 5usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_remove_key_arg() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_remove_key_arg>(),
            64usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_remove_key_arg))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_remove_key_arg>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_remove_key_arg))
        );
        fn test_field_key_spec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_remove_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).key_spec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_remove_key_arg),
                    "::",
                    stringify!(key_spec)
                )
            );
        }
        test_field_key_spec();
        fn test_field_removal_status_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_remove_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).removal_status_flags) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_remove_key_arg),
                    "::",
                    stringify!(removal_status_flags)
                )
            );
        }
        test_field_removal_status_flags();
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_remove_key_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                44usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_remove_key_arg),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct lkl_fscrypt_get_key_status_arg {
        pub key_spec: lkl_fscrypt_key_specifier,
        pub __reserved: [__lkl__u32; 6usize],
        pub status: __lkl__u32,
        pub status_flags: __lkl__u32,
        pub user_count: __lkl__u32,
        pub __out_reserved: [__lkl__u32; 13usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_fscrypt_get_key_status_arg() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fscrypt_get_key_status_arg>(),
            128usize,
            concat!("Size of: ", stringify!(lkl_fscrypt_get_key_status_arg))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fscrypt_get_key_status_arg>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_fscrypt_get_key_status_arg))
        );
        fn test_field_key_spec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_key_status_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).key_spec) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_key_status_arg),
                    "::",
                    stringify!(key_spec)
                )
            );
        }
        test_field_key_spec();
        fn test_field___reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_key_status_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_key_status_arg),
                    "::",
                    stringify!(__reserved)
                )
            );
        }
        test_field___reserved();
        fn test_field_status() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_key_status_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_key_status_arg),
                    "::",
                    stringify!(status)
                )
            );
        }
        test_field_status();
        fn test_field_status_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_key_status_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).status_flags) as usize - ptr as usize
                },
                68usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_key_status_arg),
                    "::",
                    stringify!(status_flags)
                )
            );
        }
        test_field_status_flags();
        fn test_field_user_count() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_key_status_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).user_count) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_key_status_arg),
                    "::",
                    stringify!(user_count)
                )
            );
        }
        test_field_user_count();
        fn test_field___out_reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fscrypt_get_key_status_arg>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__out_reserved) as usize - ptr as usize
                },
                76usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fscrypt_get_key_status_arg),
                    "::",
                    stringify!(__out_reserved)
                )
            );
        }
        test_field___out_reserved();
    }
    pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_FLAG: lkl_fsconfig_command = 0;
    pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_STRING: lkl_fsconfig_command = 1;
    pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_BINARY: lkl_fsconfig_command = 2;
    pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_PATH: lkl_fsconfig_command = 3;
    pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_PATH_EMPTY: lkl_fsconfig_command = 4;
    pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_FD: lkl_fsconfig_command = 5;
    pub const lkl_fsconfig_command_LKL_FSCONFIG_CMD_CREATE: lkl_fsconfig_command = 6;
    pub const lkl_fsconfig_command_LKL_FSCONFIG_CMD_RECONFIGURE: lkl_fsconfig_command = 7;
    pub type lkl_fsconfig_command = ::std::os::raw::c_uint;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_file_clone_range {
        pub src_fd: __lkl__s64,
        pub src_offset: __lkl__u64,
        pub src_length: __lkl__u64,
        pub dest_offset: __lkl__u64,
    }
    #[test]
    fn bindgen_test_layout_lkl_file_clone_range() {
        assert_eq!(
            ::std::mem::size_of::<lkl_file_clone_range>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_file_clone_range))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_file_clone_range>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_file_clone_range))
        );
        fn test_field_src_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_clone_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).src_fd) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_clone_range),
                    "::",
                    stringify!(src_fd)
                )
            );
        }
        test_field_src_fd();
        fn test_field_src_offset() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_clone_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).src_offset) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_clone_range),
                    "::",
                    stringify!(src_offset)
                )
            );
        }
        test_field_src_offset();
        fn test_field_src_length() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_clone_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).src_length) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_clone_range),
                    "::",
                    stringify!(src_length)
                )
            );
        }
        test_field_src_length();
        fn test_field_dest_offset() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_clone_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).dest_offset) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_clone_range),
                    "::",
                    stringify!(dest_offset)
                )
            );
        }
        test_field_dest_offset();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_fstrim_range {
        pub start: __lkl__u64,
        pub len: __lkl__u64,
        pub minlen: __lkl__u64,
    }
    #[test]
    fn bindgen_test_layout_lkl_fstrim_range() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fstrim_range>(),
            24usize,
            concat!("Size of: ", stringify!(lkl_fstrim_range))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fstrim_range>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_fstrim_range))
        );
        fn test_field_start() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fstrim_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fstrim_range),
                    "::",
                    stringify!(start)
                )
            );
        }
        test_field_start();
        fn test_field_len() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fstrim_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fstrim_range),
                    "::",
                    stringify!(len)
                )
            );
        }
        test_field_len();
        fn test_field_minlen() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fstrim_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).minlen) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fstrim_range),
                    "::",
                    stringify!(minlen)
                )
            );
        }
        test_field_minlen();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_file_dedupe_range_info {
        pub dest_fd: __lkl__s64,
        pub dest_offset: __lkl__u64,
        pub bytes_deduped: __lkl__u64,
        pub status: __lkl__s32,
        pub reserved: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_file_dedupe_range_info() {
        assert_eq!(
            ::std::mem::size_of::<lkl_file_dedupe_range_info>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_file_dedupe_range_info))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_file_dedupe_range_info>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_file_dedupe_range_info))
        );
        fn test_field_dest_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range_info>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).dest_fd) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range_info),
                    "::",
                    stringify!(dest_fd)
                )
            );
        }
        test_field_dest_fd();
        fn test_field_dest_offset() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range_info>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).dest_offset) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range_info),
                    "::",
                    stringify!(dest_offset)
                )
            );
        }
        test_field_dest_offset();
        fn test_field_bytes_deduped() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range_info>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).bytes_deduped) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range_info),
                    "::",
                    stringify!(bytes_deduped)
                )
            );
        }
        test_field_bytes_deduped();
        fn test_field_status() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range_info>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range_info),
                    "::",
                    stringify!(status)
                )
            );
        }
        test_field_status();
        fn test_field_reserved() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range_info>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize
                },
                28usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range_info),
                    "::",
                    stringify!(reserved)
                )
            );
        }
        test_field_reserved();
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct lkl_file_dedupe_range {
        pub src_offset: __lkl__u64,
        pub src_length: __lkl__u64,
        pub dest_count: __lkl__u16,
        pub reserved1: __lkl__u16,
        pub reserved2: __lkl__u32,
        pub info: __IncompleteArrayField<lkl_file_dedupe_range_info>,
    }
    #[test]
    fn bindgen_test_layout_lkl_file_dedupe_range() {
        assert_eq!(
            ::std::mem::size_of::<lkl_file_dedupe_range>(),
            24usize,
            concat!("Size of: ", stringify!(lkl_file_dedupe_range))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_file_dedupe_range>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_file_dedupe_range))
        );
        fn test_field_src_offset() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).src_offset) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range),
                    "::",
                    stringify!(src_offset)
                )
            );
        }
        test_field_src_offset();
        fn test_field_src_length() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).src_length) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range),
                    "::",
                    stringify!(src_length)
                )
            );
        }
        test_field_src_length();
        fn test_field_dest_count() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).dest_count) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range),
                    "::",
                    stringify!(dest_count)
                )
            );
        }
        test_field_dest_count();
        fn test_field_reserved1() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize
                },
                18usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range),
                    "::",
                    stringify!(reserved1)
                )
            );
        }
        test_field_reserved1();
        fn test_field_reserved2() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize
                },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range),
                    "::",
                    stringify!(reserved2)
                )
            );
        }
        test_field_reserved2();
        fn test_field_info() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_file_dedupe_range>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_file_dedupe_range),
                    "::",
                    stringify!(info)
                )
            );
        }
        test_field_info();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_files_stat_struct {
        pub nr_files: ::std::os::raw::c_ulong,
        pub nr_free_files: ::std::os::raw::c_ulong,
        pub max_files: ::std::os::raw::c_ulong,
    }
    #[test]
    fn bindgen_test_layout_lkl_files_stat_struct() {
        assert_eq!(
            ::std::mem::size_of::<lkl_files_stat_struct>(),
            24usize,
            concat!("Size of: ", stringify!(lkl_files_stat_struct))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_files_stat_struct>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_files_stat_struct))
        );
        fn test_field_nr_files() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_files_stat_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).nr_files) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_files_stat_struct),
                    "::",
                    stringify!(nr_files)
                )
            );
        }
        test_field_nr_files();
        fn test_field_nr_free_files() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_files_stat_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).nr_free_files) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_files_stat_struct),
                    "::",
                    stringify!(nr_free_files)
                )
            );
        }
        test_field_nr_free_files();
        fn test_field_max_files() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_files_stat_struct>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).max_files) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_files_stat_struct),
                    "::",
                    stringify!(max_files)
                )
            );
        }
        test_field_max_files();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_inodes_stat_t {
        pub nr_inodes: ::std::os::raw::c_long,
        pub nr_unused: ::std::os::raw::c_long,
        pub dummy: [::std::os::raw::c_long; 5usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_inodes_stat_t() {
        assert_eq!(
            ::std::mem::size_of::<lkl_inodes_stat_t>(),
            56usize,
            concat!("Size of: ", stringify!(lkl_inodes_stat_t))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_inodes_stat_t>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_inodes_stat_t))
        );
        fn test_field_nr_inodes() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_inodes_stat_t>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).nr_inodes) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_inodes_stat_t),
                    "::",
                    stringify!(nr_inodes)
                )
            );
        }
        test_field_nr_inodes();
        fn test_field_nr_unused() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_inodes_stat_t>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).nr_unused) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_inodes_stat_t),
                    "::",
                    stringify!(nr_unused)
                )
            );
        }
        test_field_nr_unused();
        fn test_field_dummy() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_inodes_stat_t>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_inodes_stat_t),
                    "::",
                    stringify!(dummy)
                )
            );
        }
        test_field_dummy();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_fsxattr {
        pub fsx_xflags: __lkl__u32,
        pub fsx_extsize: __lkl__u32,
        pub fsx_nextents: __lkl__u32,
        pub fsx_projid: __lkl__u32,
        pub fsx_cowextsize: __lkl__u32,
        pub fsx_pad: [::std::os::raw::c_uchar; 8usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_fsxattr() {
        assert_eq!(
            ::std::mem::size_of::<lkl_fsxattr>(),
            28usize,
            concat!("Size of: ", stringify!(lkl_fsxattr))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_fsxattr>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_fsxattr))
        );
        fn test_field_fsx_xflags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fsxattr>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).fsx_xflags) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fsxattr),
                    "::",
                    stringify!(fsx_xflags)
                )
            );
        }
        test_field_fsx_xflags();
        fn test_field_fsx_extsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fsxattr>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).fsx_extsize) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fsxattr),
                    "::",
                    stringify!(fsx_extsize)
                )
            );
        }
        test_field_fsx_extsize();
        fn test_field_fsx_nextents() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fsxattr>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).fsx_nextents) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fsxattr),
                    "::",
                    stringify!(fsx_nextents)
                )
            );
        }
        test_field_fsx_nextents();
        fn test_field_fsx_projid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fsxattr>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).fsx_projid) as usize - ptr as usize
                },
                12usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fsxattr),
                    "::",
                    stringify!(fsx_projid)
                )
            );
        }
        test_field_fsx_projid();
        fn test_field_fsx_cowextsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fsxattr>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).fsx_cowextsize) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fsxattr),
                    "::",
                    stringify!(fsx_cowextsize)
                )
            );
        }
        test_field_fsx_cowextsize();
        fn test_field_fsx_pad() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_fsxattr>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).fsx_pad) as usize - ptr as usize
                },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_fsxattr),
                    "::",
                    stringify!(fsx_pad)
                )
            );
        }
        test_field_fsx_pad();
    }
    pub type __lkl__kernel_rwf_t = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_statfs {
        pub f_type: __lkl__kernel_long_t,
        pub f_bsize: __lkl__kernel_long_t,
        pub f_blocks: __lkl__kernel_long_t,
        pub f_bfree: __lkl__kernel_long_t,
        pub f_bavail: __lkl__kernel_long_t,
        pub f_files: __lkl__kernel_long_t,
        pub f_ffree: __lkl__kernel_long_t,
        pub f_fsid: __lkl__kernel_fsid_t,
        pub f_namelen: __lkl__kernel_long_t,
        pub f_frsize: __lkl__kernel_long_t,
        pub f_flags: __lkl__kernel_long_t,
        pub f_spare: [__lkl__kernel_long_t; 4usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_statfs() {
        assert_eq!(
            ::std::mem::size_of::<lkl_statfs>(),
            120usize,
            concat!("Size of: ", stringify!(lkl_statfs))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_statfs>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_statfs))
        );
        fn test_field_f_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_type) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_type)
                )
            );
        }
        test_field_f_type();
        fn test_field_f_bsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bsize) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_bsize)
                )
            );
        }
        test_field_f_bsize();
        fn test_field_f_blocks() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_blocks) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_blocks)
                )
            );
        }
        test_field_f_blocks();
        fn test_field_f_bfree() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bfree) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_bfree)
                )
            );
        }
        test_field_f_bfree();
        fn test_field_f_bavail() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bavail) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_bavail)
                )
            );
        }
        test_field_f_bavail();
        fn test_field_f_files() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_files) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_files)
                )
            );
        }
        test_field_f_files();
        fn test_field_f_ffree() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_ffree) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_ffree)
                )
            );
        }
        test_field_f_ffree();
        fn test_field_f_fsid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_fsid) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_fsid)
                )
            );
        }
        test_field_f_fsid();
        fn test_field_f_namelen() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_namelen) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_namelen)
                )
            );
        }
        test_field_f_namelen();
        fn test_field_f_frsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_frsize) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_frsize)
                )
            );
        }
        test_field_f_frsize();
        fn test_field_f_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_flags) as usize - ptr as usize
                },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_flags)
                )
            );
        }
        test_field_f_flags();
        fn test_field_f_spare() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_spare) as usize - ptr as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs),
                    "::",
                    stringify!(f_spare)
                )
            );
        }
        test_field_f_spare();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_statfs64 {
        pub f_type: __lkl__kernel_long_t,
        pub f_bsize: __lkl__kernel_long_t,
        pub f_blocks: __lkl__u64,
        pub f_bfree: __lkl__u64,
        pub f_bavail: __lkl__u64,
        pub f_files: __lkl__u64,
        pub f_ffree: __lkl__u64,
        pub f_fsid: __lkl__kernel_fsid_t,
        pub f_namelen: __lkl__kernel_long_t,
        pub f_frsize: __lkl__kernel_long_t,
        pub f_flags: __lkl__kernel_long_t,
        pub f_spare: [__lkl__kernel_long_t; 4usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_statfs64() {
        assert_eq!(
            ::std::mem::size_of::<lkl_statfs64>(),
            120usize,
            concat!("Size of: ", stringify!(lkl_statfs64))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_statfs64>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_statfs64))
        );
        fn test_field_f_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_type) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_type)
                )
            );
        }
        test_field_f_type();
        fn test_field_f_bsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bsize) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_bsize)
                )
            );
        }
        test_field_f_bsize();
        fn test_field_f_blocks() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_blocks) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_blocks)
                )
            );
        }
        test_field_f_blocks();
        fn test_field_f_bfree() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bfree) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_bfree)
                )
            );
        }
        test_field_f_bfree();
        fn test_field_f_bavail() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bavail) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_bavail)
                )
            );
        }
        test_field_f_bavail();
        fn test_field_f_files() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_files) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_files)
                )
            );
        }
        test_field_f_files();
        fn test_field_f_ffree() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_ffree) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_ffree)
                )
            );
        }
        test_field_f_ffree();
        fn test_field_f_fsid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_fsid) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_fsid)
                )
            );
        }
        test_field_f_fsid();
        fn test_field_f_namelen() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_namelen) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_namelen)
                )
            );
        }
        test_field_f_namelen();
        fn test_field_f_frsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_frsize) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_frsize)
                )
            );
        }
        test_field_f_frsize();
        fn test_field_f_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_flags) as usize - ptr as usize
                },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_flags)
                )
            );
        }
        test_field_f_flags();
        fn test_field_f_spare() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_spare) as usize - ptr as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_statfs64),
                    "::",
                    stringify!(f_spare)
                )
            );
        }
        test_field_f_spare();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_compat_statfs64 {
        pub f_type: __lkl__u32,
        pub f_bsize: __lkl__u32,
        pub f_blocks: __lkl__u64,
        pub f_bfree: __lkl__u64,
        pub f_bavail: __lkl__u64,
        pub f_files: __lkl__u64,
        pub f_ffree: __lkl__u64,
        pub f_fsid: __lkl__kernel_fsid_t,
        pub f_namelen: __lkl__u32,
        pub f_frsize: __lkl__u32,
        pub f_flags: __lkl__u32,
        pub f_spare: [__lkl__u32; 4usize],
    }
    #[test]
    fn bindgen_test_layout_lkl_compat_statfs64() {
        assert_eq!(
            ::std::mem::size_of::<lkl_compat_statfs64>(),
            88usize,
            concat!("Size of: ", stringify!(lkl_compat_statfs64))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_compat_statfs64>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_compat_statfs64))
        );
        fn test_field_f_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_type) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_type)
                )
            );
        }
        test_field_f_type();
        fn test_field_f_bsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bsize) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_bsize)
                )
            );
        }
        test_field_f_bsize();
        fn test_field_f_blocks() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_blocks) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_blocks)
                )
            );
        }
        test_field_f_blocks();
        fn test_field_f_bfree() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bfree) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_bfree)
                )
            );
        }
        test_field_f_bfree();
        fn test_field_f_bavail() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_bavail) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_bavail)
                )
            );
        }
        test_field_f_bavail();
        fn test_field_f_files() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_files) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_files)
                )
            );
        }
        test_field_f_files();
        fn test_field_f_ffree() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_ffree) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_ffree)
                )
            );
        }
        test_field_f_ffree();
        fn test_field_f_fsid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_fsid) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_fsid)
                )
            );
        }
        test_field_f_fsid();
        fn test_field_f_namelen() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_namelen) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_namelen)
                )
            );
        }
        test_field_f_namelen();
        fn test_field_f_frsize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_frsize) as usize - ptr as usize
                },
                60usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_frsize)
                )
            );
        }
        test_field_f_frsize();
        fn test_field_f_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_flags) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_flags)
                )
            );
        }
        test_field_f_flags();
        fn test_field_f_spare() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_compat_statfs64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).f_spare) as usize - ptr as usize
                },
                68usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_compat_statfs64),
                    "::",
                    stringify!(f_spare)
                )
            );
        }
        test_field_f_spare();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_stat {
        pub st_dev: ::std::os::raw::c_ulong,
        pub st_ino: ::std::os::raw::c_ulong,
        pub st_mode: ::std::os::raw::c_uint,
        pub st_nlink: ::std::os::raw::c_uint,
        pub st_uid: ::std::os::raw::c_uint,
        pub st_gid: ::std::os::raw::c_uint,
        pub st_rdev: ::std::os::raw::c_ulong,
        pub __pad1: ::std::os::raw::c_ulong,
        pub st_size: ::std::os::raw::c_long,
        pub st_blksize: ::std::os::raw::c_int,
        pub __pad2: ::std::os::raw::c_int,
        pub st_blocks: ::std::os::raw::c_long,
        pub lkl_st_atime: ::std::os::raw::c_long,
        pub st_atime_nsec: ::std::os::raw::c_ulong,
        pub lkl_st_mtime: ::std::os::raw::c_long,
        pub st_mtime_nsec: ::std::os::raw::c_ulong,
        pub lkl_st_ctime: ::std::os::raw::c_long,
        pub st_ctime_nsec: ::std::os::raw::c_ulong,
        pub __unused4: ::std::os::raw::c_uint,
        pub __unused5: ::std::os::raw::c_uint,
    }
    #[test]
    fn bindgen_test_layout_lkl_stat() {
        assert_eq!(
            ::std::mem::size_of::<lkl_stat>(),
            128usize,
            concat!("Size of: ", stringify!(lkl_stat))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_stat>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_stat))
        );
        fn test_field_st_dev() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_dev)
                )
            );
        }
        test_field_st_dev();
        fn test_field_st_ino() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_ino)
                )
            );
        }
        test_field_st_ino();
        fn test_field_st_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_mode)
                )
            );
        }
        test_field_st_mode();
        fn test_field_st_nlink() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize
                },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_nlink)
                )
            );
        }
        test_field_st_nlink();
        fn test_field_st_uid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_uid)
                )
            );
        }
        test_field_st_uid();
        fn test_field_st_gid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize
                },
                28usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_gid)
                )
            );
        }
        test_field_st_gid();
        fn test_field_st_rdev() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_rdev)
                )
            );
        }
        test_field_st_rdev();
        fn test_field___pad1() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(__pad1)
                )
            );
        }
        test_field___pad1();
        fn test_field_st_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_size)
                )
            );
        }
        test_field_st_size();
        fn test_field_st_blksize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_blksize)
                )
            );
        }
        test_field_st_blksize();
        fn test_field___pad2() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize
                },
                60usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(__pad2)
                )
            );
        }
        test_field___pad2();
        fn test_field_st_blocks() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_blocks)
                )
            );
        }
        test_field_st_blocks();
        fn test_field_lkl_st_atime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).lkl_st_atime) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(lkl_st_atime)
                )
            );
        }
        test_field_lkl_st_atime();
        fn test_field_st_atime_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_atime_nsec) as usize - ptr as usize
                },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_atime_nsec)
                )
            );
        }
        test_field_st_atime_nsec();
        fn test_field_lkl_st_mtime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).lkl_st_mtime) as usize - ptr as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(lkl_st_mtime)
                )
            );
        }
        test_field_lkl_st_mtime();
        fn test_field_st_mtime_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_mtime_nsec) as usize - ptr as usize
                },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_mtime_nsec)
                )
            );
        }
        test_field_st_mtime_nsec();
        fn test_field_lkl_st_ctime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).lkl_st_ctime) as usize - ptr as usize
                },
                104usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(lkl_st_ctime)
                )
            );
        }
        test_field_lkl_st_ctime();
        fn test_field_st_ctime_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_ctime_nsec) as usize - ptr as usize
                },
                112usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(st_ctime_nsec)
                )
            );
        }
        test_field_st_ctime_nsec();
        fn test_field___unused4() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__unused4) as usize - ptr as usize
                },
                120usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(__unused4)
                )
            );
        }
        test_field___unused4();
        fn test_field___unused5() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__unused5) as usize - ptr as usize
                },
                124usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat),
                    "::",
                    stringify!(__unused5)
                )
            );
        }
        test_field___unused5();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_stat64 {
        pub st_dev: ::std::os::raw::c_ulonglong,
        pub st_ino: ::std::os::raw::c_ulonglong,
        pub st_mode: ::std::os::raw::c_uint,
        pub st_nlink: ::std::os::raw::c_uint,
        pub st_uid: ::std::os::raw::c_uint,
        pub st_gid: ::std::os::raw::c_uint,
        pub st_rdev: ::std::os::raw::c_ulonglong,
        pub __pad1: ::std::os::raw::c_ulonglong,
        pub st_size: ::std::os::raw::c_longlong,
        pub st_blksize: ::std::os::raw::c_int,
        pub __pad2: ::std::os::raw::c_int,
        pub st_blocks: ::std::os::raw::c_longlong,
        pub lkl_st_atime: ::std::os::raw::c_int,
        pub st_atime_nsec: ::std::os::raw::c_uint,
        pub lkl_st_mtime: ::std::os::raw::c_int,
        pub st_mtime_nsec: ::std::os::raw::c_uint,
        pub lkl_st_ctime: ::std::os::raw::c_int,
        pub st_ctime_nsec: ::std::os::raw::c_uint,
        pub __unused4: ::std::os::raw::c_uint,
        pub __unused5: ::std::os::raw::c_uint,
    }
    #[test]
    fn bindgen_test_layout_lkl_stat64() {
        assert_eq!(
            ::std::mem::size_of::<lkl_stat64>(),
            104usize,
            concat!("Size of: ", stringify!(lkl_stat64))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_stat64>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_stat64))
        );
        fn test_field_st_dev() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_dev)
                )
            );
        }
        test_field_st_dev();
        fn test_field_st_ino() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_ino)
                )
            );
        }
        test_field_st_ino();
        fn test_field_st_mode() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_mode)
                )
            );
        }
        test_field_st_mode();
        fn test_field_st_nlink() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize
                },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_nlink)
                )
            );
        }
        test_field_st_nlink();
        fn test_field_st_uid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_uid)
                )
            );
        }
        test_field_st_uid();
        fn test_field_st_gid() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize
                },
                28usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_gid)
                )
            );
        }
        test_field_st_gid();
        fn test_field_st_rdev() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_rdev)
                )
            );
        }
        test_field_st_rdev();
        fn test_field___pad1() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(__pad1)
                )
            );
        }
        test_field___pad1();
        fn test_field_st_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_size)
                )
            );
        }
        test_field_st_size();
        fn test_field_st_blksize() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_blksize)
                )
            );
        }
        test_field_st_blksize();
        fn test_field___pad2() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize
                },
                60usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(__pad2)
                )
            );
        }
        test_field___pad2();
        fn test_field_st_blocks() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_blocks)
                )
            );
        }
        test_field_st_blocks();
        fn test_field_lkl_st_atime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).lkl_st_atime) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(lkl_st_atime)
                )
            );
        }
        test_field_lkl_st_atime();
        fn test_field_st_atime_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_atime_nsec) as usize - ptr as usize
                },
                76usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_atime_nsec)
                )
            );
        }
        test_field_st_atime_nsec();
        fn test_field_lkl_st_mtime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).lkl_st_mtime) as usize - ptr as usize
                },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(lkl_st_mtime)
                )
            );
        }
        test_field_lkl_st_mtime();
        fn test_field_st_mtime_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_mtime_nsec) as usize - ptr as usize
                },
                84usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_mtime_nsec)
                )
            );
        }
        test_field_st_mtime_nsec();
        fn test_field_lkl_st_ctime() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).lkl_st_ctime) as usize - ptr as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(lkl_st_ctime)
                )
            );
        }
        test_field_lkl_st_ctime();
        fn test_field_st_ctime_nsec() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).st_ctime_nsec) as usize - ptr as usize
                },
                92usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(st_ctime_nsec)
                )
            );
        }
        test_field_st_ctime_nsec();
        fn test_field___unused4() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__unused4) as usize - ptr as usize
                },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(__unused4)
                )
            );
        }
        test_field___unused4();
        fn test_field___unused5() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_stat64>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).__unused5) as usize - ptr as usize
                },
                100usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_stat64),
                    "::",
                    stringify!(__unused5)
                )
            );
        }
        test_field___unused5();
    }
    pub const LKL_BPF_REG_0: _bindgen_ty_1 = 0;
    pub const LKL_BPF_REG_1: _bindgen_ty_1 = 1;
    pub const LKL_BPF_REG_2: _bindgen_ty_1 = 2;
    pub const LKL_BPF_REG_3: _bindgen_ty_1 = 3;
    pub const LKL_BPF_REG_4: _bindgen_ty_1 = 4;
    pub const LKL_BPF_REG_5: _bindgen_ty_1 = 5;
    pub const LKL_BPF_REG_6: _bindgen_ty_1 = 6;
    pub const LKL_BPF_REG_7: _bindgen_ty_1 = 7;
    pub const LKL_BPF_REG_8: _bindgen_ty_1 = 8;
    pub const LKL_BPF_REG_9: _bindgen_ty_1 = 9;
    pub const LKL_BPF_REG_10: _bindgen_ty_1 = 10;
    pub const __LKL__MAX_BPF_REG: _bindgen_ty_1 = 11;
    pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_insn {
        pub code: __lkl__u8,
        pub _bitfield_align_1: [u8; 0],
        pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
        pub off: __lkl__s16,
        pub imm: __lkl__s32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_insn() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_insn>(),
            8usize,
            concat!("Size of: ", stringify!(lkl_bpf_insn))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_insn>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_bpf_insn))
        );
        fn test_field_code() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_insn>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_insn),
                    "::",
                    stringify!(code)
                )
            );
        }
        test_field_code();
        fn test_field_off() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_insn>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).off) as usize - ptr as usize
                },
                2usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_insn),
                    "::",
                    stringify!(off)
                )
            );
        }
        test_field_off();
        fn test_field_imm() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_insn>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).imm) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_insn),
                    "::",
                    stringify!(imm)
                )
            );
        }
        test_field_imm();
    }
    impl lkl_bpf_insn {
        #[inline]
        pub fn dst_reg(&self) -> __lkl__u8 {
            unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
        }
        #[inline]
        pub fn set_dst_reg(&mut self, val: __lkl__u8) {
            unsafe {
                let val: u8 = ::std::mem::transmute(val);
                self._bitfield_1.set(0usize, 4u8, val as u64)
            }
        }
        #[inline]
        pub fn src_reg(&self) -> __lkl__u8 {
            unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
        }
        #[inline]
        pub fn set_src_reg(&mut self, val: __lkl__u8) {
            unsafe {
                let val: u8 = ::std::mem::transmute(val);
                self._bitfield_1.set(4usize, 4u8, val as u64)
            }
        }
        #[inline]
        pub fn new_bitfield_1(
            dst_reg: __lkl__u8,
            src_reg: __lkl__u8,
        ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
            let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
            __bindgen_bitfield_unit.set(0usize, 4u8, {
                let dst_reg: u8 = unsafe { ::std::mem::transmute(dst_reg) };
                dst_reg as u64
            });
            __bindgen_bitfield_unit.set(4usize, 4u8, {
                let src_reg: u8 = unsafe { ::std::mem::transmute(src_reg) };
                src_reg as u64
            });
            __bindgen_bitfield_unit
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct lkl_bpf_lpm_trie_key {
        pub prefixlen: __lkl__u32,
        pub data: __IncompleteArrayField<__lkl__u8>,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_lpm_trie_key() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_lpm_trie_key>(),
            4usize,
            concat!("Size of: ", stringify!(lkl_bpf_lpm_trie_key))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_lpm_trie_key>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_bpf_lpm_trie_key))
        );
        fn test_field_prefixlen() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_lpm_trie_key>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prefixlen) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_lpm_trie_key),
                    "::",
                    stringify!(prefixlen)
                )
            );
        }
        test_field_prefixlen();
        fn test_field_data() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_lpm_trie_key>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_lpm_trie_key),
                    "::",
                    stringify!(data)
                )
            );
        }
        test_field_data();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_cgroup_storage_key {
        pub cgroup_inode_id: __lkl__u64,
        pub attach_type: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_cgroup_storage_key() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_cgroup_storage_key>(),
            16usize,
            concat!("Size of: ", stringify!(lkl_bpf_cgroup_storage_key))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_cgroup_storage_key>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_bpf_cgroup_storage_key))
        );
        fn test_field_cgroup_inode_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_cgroup_storage_key>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).cgroup_inode_id) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_cgroup_storage_key),
                    "::",
                    stringify!(cgroup_inode_id)
                )
            );
        }
        test_field_cgroup_inode_id();
        fn test_field_attach_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_cgroup_storage_key>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).attach_type) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_cgroup_storage_key),
                    "::",
                    stringify!(attach_type)
                )
            );
        }
        test_field_attach_type();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union lkl_bpf_iter_link_info {
        pub map: lkl_bpf_iter_link_info__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_iter_link_info__bindgen_ty_1 {
        pub map_fd: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_iter_link_info__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_iter_link_info__bindgen_ty_1>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(lkl_bpf_iter_link_info__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_iter_link_info__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_bpf_iter_link_info__bindgen_ty_1)
            )
        );
        fn test_field_map_fd() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_iter_link_info__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_fd) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_iter_link_info__bindgen_ty_1),
                    "::",
                    stringify!(map_fd)
                )
            );
        }
        test_field_map_fd();
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_iter_link_info() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_iter_link_info>(),
            4usize,
            concat!("Size of: ", stringify!(lkl_bpf_iter_link_info))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_iter_link_info>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_bpf_iter_link_info))
        );
        fn test_field_map() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_iter_link_info>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_iter_link_info),
                    "::",
                    stringify!(map)
                )
            );
        }
        test_field_map();
    }
    pub const lkl_bpf_cmd_LKL_BPF_MAP_CREATE: lkl_bpf_cmd = 0;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_ELEM: lkl_bpf_cmd = 1;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_UPDATE_ELEM: lkl_bpf_cmd = 2;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_DELETE_ELEM: lkl_bpf_cmd = 3;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_GET_NEXT_KEY: lkl_bpf_cmd = 4;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_LOAD: lkl_bpf_cmd = 5;
    pub const lkl_bpf_cmd_LKL_BPF_OBJ_PIN: lkl_bpf_cmd = 6;
    pub const lkl_bpf_cmd_LKL_BPF_OBJ_GET: lkl_bpf_cmd = 7;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_ATTACH: lkl_bpf_cmd = 8;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_DETACH: lkl_bpf_cmd = 9;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_TEST_RUN: lkl_bpf_cmd = 10;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_GET_NEXT_ID: lkl_bpf_cmd = 11;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_GET_NEXT_ID: lkl_bpf_cmd = 12;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_GET_FD_BY_ID: lkl_bpf_cmd = 13;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_GET_FD_BY_ID: lkl_bpf_cmd = 14;
    pub const lkl_bpf_cmd_LKL_BPF_OBJ_GET_INFO_BY_FD: lkl_bpf_cmd = 15;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_QUERY: lkl_bpf_cmd = 16;
    pub const lkl_bpf_cmd_LKL_BPF_RAW_TRACEPOINT_OPEN: lkl_bpf_cmd = 17;
    pub const lkl_bpf_cmd_LKL_BPF_BTF_LOAD: lkl_bpf_cmd = 18;
    pub const lkl_bpf_cmd_LKL_BPF_BTF_GET_FD_BY_ID: lkl_bpf_cmd = 19;
    pub const lkl_bpf_cmd_LKL_BPF_TASK_FD_QUERY: lkl_bpf_cmd = 20;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_AND_DELETE_ELEM: lkl_bpf_cmd = 21;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_FREEZE: lkl_bpf_cmd = 22;
    pub const lkl_bpf_cmd_LKL_BPF_BTF_GET_NEXT_ID: lkl_bpf_cmd = 23;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_BATCH: lkl_bpf_cmd = 24;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_AND_DELETE_BATCH: lkl_bpf_cmd = 25;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_UPDATE_BATCH: lkl_bpf_cmd = 26;
    pub const lkl_bpf_cmd_LKL_BPF_MAP_DELETE_BATCH: lkl_bpf_cmd = 27;
    pub const lkl_bpf_cmd_LKL_BPF_LINK_CREATE: lkl_bpf_cmd = 28;
    pub const lkl_bpf_cmd_LKL_BPF_LINK_UPDATE: lkl_bpf_cmd = 29;
    pub const lkl_bpf_cmd_LKL_BPF_LINK_GET_FD_BY_ID: lkl_bpf_cmd = 30;
    pub const lkl_bpf_cmd_LKL_BPF_LINK_GET_NEXT_ID: lkl_bpf_cmd = 31;
    pub const lkl_bpf_cmd_LKL_BPF_ENABLE_STATS: lkl_bpf_cmd = 32;
    pub const lkl_bpf_cmd_LKL_BPF_ITER_CREATE: lkl_bpf_cmd = 33;
    pub const lkl_bpf_cmd_LKL_BPF_LINK_DETACH: lkl_bpf_cmd = 34;
    pub const lkl_bpf_cmd_LKL_BPF_PROG_BIND_MAP: lkl_bpf_cmd = 35;
    pub type lkl_bpf_cmd = ::std::os::raw::c_uint;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_UNSPEC: lkl_bpf_map_type = 0;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_HASH: lkl_bpf_map_type = 1;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_ARRAY: lkl_bpf_map_type = 2;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PROG_ARRAY: lkl_bpf_map_type = 3;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERF_EVENT_ARRAY: lkl_bpf_map_type = 4;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERCPU_HASH: lkl_bpf_map_type = 5;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERCPU_ARRAY: lkl_bpf_map_type = 6;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_STACK_TRACE: lkl_bpf_map_type = 7;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_CGROUP_ARRAY: lkl_bpf_map_type = 8;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_LRU_HASH: lkl_bpf_map_type = 9;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_LRU_PERCPU_HASH: lkl_bpf_map_type = 10;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_LPM_TRIE: lkl_bpf_map_type = 11;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_ARRAY_OF_MAPS: lkl_bpf_map_type = 12;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_HASH_OF_MAPS: lkl_bpf_map_type = 13;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_DEVMAP: lkl_bpf_map_type = 14;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_SOCKMAP: lkl_bpf_map_type = 15;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_CPUMAP: lkl_bpf_map_type = 16;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_XSKMAP: lkl_bpf_map_type = 17;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_SOCKHASH: lkl_bpf_map_type = 18;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_CGROUP_STORAGE: lkl_bpf_map_type = 19;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_REUSEPORT_SOCKARRAY: lkl_bpf_map_type = 20;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERCPU_CGROUP_STORAGE: lkl_bpf_map_type = 21;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_QUEUE: lkl_bpf_map_type = 22;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_STACK: lkl_bpf_map_type = 23;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_SK_STORAGE: lkl_bpf_map_type = 24;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_DEVMAP_HASH: lkl_bpf_map_type = 25;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_STRUCT_OPS: lkl_bpf_map_type = 26;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_RINGBUF: lkl_bpf_map_type = 27;
    pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_INODE_STORAGE: lkl_bpf_map_type = 28;
    pub type lkl_bpf_map_type = ::std::os::raw::c_uint;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_UNSPEC: lkl_bpf_prog_type = 0;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SOCKET_FILTER: lkl_bpf_prog_type = 1;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_KPROBE: lkl_bpf_prog_type = 2;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SCHED_CLS: lkl_bpf_prog_type = 3;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SCHED_ACT: lkl_bpf_prog_type = 4;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_TRACEPOINT: lkl_bpf_prog_type = 5;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_XDP: lkl_bpf_prog_type = 6;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_PERF_EVENT: lkl_bpf_prog_type = 7;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SKB: lkl_bpf_prog_type = 8;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SOCK: lkl_bpf_prog_type = 9;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_IN: lkl_bpf_prog_type = 10;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_OUT: lkl_bpf_prog_type = 11;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_XMIT: lkl_bpf_prog_type = 12;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SOCK_OPS: lkl_bpf_prog_type = 13;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_SKB: lkl_bpf_prog_type = 14;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_DEVICE: lkl_bpf_prog_type = 15;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_MSG: lkl_bpf_prog_type = 16;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_RAW_TRACEPOINT: lkl_bpf_prog_type = 17;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SOCK_ADDR: lkl_bpf_prog_type = 18;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_SEG6LOCAL: lkl_bpf_prog_type = 19;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LIRC_MODE2: lkl_bpf_prog_type = 20;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_REUSEPORT: lkl_bpf_prog_type = 21;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_FLOW_DISSECTOR: lkl_bpf_prog_type = 22;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SYSCTL: lkl_bpf_prog_type = 23;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_RAW_TRACEPOINT_WRITABLE: lkl_bpf_prog_type = 24;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SOCKOPT: lkl_bpf_prog_type = 25;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_TRACING: lkl_bpf_prog_type = 26;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_STRUCT_OPS: lkl_bpf_prog_type = 27;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_EXT: lkl_bpf_prog_type = 28;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LSM: lkl_bpf_prog_type = 29;
    pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_LOOKUP: lkl_bpf_prog_type = 30;
    pub type lkl_bpf_prog_type = ::std::os::raw::c_uint;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_INGRESS: lkl_bpf_attach_type = 0;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_EGRESS: lkl_bpf_attach_type = 1;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_SOCK_CREATE: lkl_bpf_attach_type = 2;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_SOCK_OPS: lkl_bpf_attach_type = 3;
    pub const lkl_bpf_attach_type_LKL_BPF_SK_SKB_STREAM_PARSER: lkl_bpf_attach_type = 4;
    pub const lkl_bpf_attach_type_LKL_BPF_SK_SKB_STREAM_VERDICT: lkl_bpf_attach_type = 5;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_DEVICE: lkl_bpf_attach_type = 6;
    pub const lkl_bpf_attach_type_LKL_BPF_SK_MSG_VERDICT: lkl_bpf_attach_type = 7;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_BIND: lkl_bpf_attach_type = 8;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_BIND: lkl_bpf_attach_type = 9;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_CONNECT: lkl_bpf_attach_type = 10;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_CONNECT: lkl_bpf_attach_type = 11;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_POST_BIND: lkl_bpf_attach_type = 12;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_POST_BIND: lkl_bpf_attach_type = 13;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP4_SENDMSG: lkl_bpf_attach_type = 14;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP6_SENDMSG: lkl_bpf_attach_type = 15;
    pub const lkl_bpf_attach_type_LKL_BPF_LIRC_MODE2: lkl_bpf_attach_type = 16;
    pub const lkl_bpf_attach_type_LKL_BPF_FLOW_DISSECTOR: lkl_bpf_attach_type = 17;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_SYSCTL: lkl_bpf_attach_type = 18;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP4_RECVMSG: lkl_bpf_attach_type = 19;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP6_RECVMSG: lkl_bpf_attach_type = 20;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_GETSOCKOPT: lkl_bpf_attach_type = 21;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_SETSOCKOPT: lkl_bpf_attach_type = 22;
    pub const lkl_bpf_attach_type_LKL_BPF_TRACE_RAW_TP: lkl_bpf_attach_type = 23;
    pub const lkl_bpf_attach_type_LKL_BPF_TRACE_FENTRY: lkl_bpf_attach_type = 24;
    pub const lkl_bpf_attach_type_LKL_BPF_TRACE_FEXIT: lkl_bpf_attach_type = 25;
    pub const lkl_bpf_attach_type_LKL_BPF_MODIFY_RETURN: lkl_bpf_attach_type = 26;
    pub const lkl_bpf_attach_type_LKL_BPF_LSM_MAC: lkl_bpf_attach_type = 27;
    pub const lkl_bpf_attach_type_LKL_BPF_TRACE_ITER: lkl_bpf_attach_type = 28;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_GETPEERNAME: lkl_bpf_attach_type = 29;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_GETPEERNAME: lkl_bpf_attach_type = 30;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_GETSOCKNAME: lkl_bpf_attach_type = 31;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_GETSOCKNAME: lkl_bpf_attach_type = 32;
    pub const lkl_bpf_attach_type_LKL_BPF_XDP_DEVMAP: lkl_bpf_attach_type = 33;
    pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_SOCK_RELEASE: lkl_bpf_attach_type = 34;
    pub const lkl_bpf_attach_type_LKL_BPF_XDP_CPUMAP: lkl_bpf_attach_type = 35;
    pub const lkl_bpf_attach_type_LKL_BPF_SK_LOOKUP: lkl_bpf_attach_type = 36;
    pub const lkl_bpf_attach_type_LKL_BPF_XDP: lkl_bpf_attach_type = 37;
    pub const lkl_bpf_attach_type___LKL__MAX_BPF_ATTACH_TYPE: lkl_bpf_attach_type = 38;
    pub type lkl_bpf_attach_type = ::std::os::raw::c_uint;
    pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_UNSPEC: lkl_bpf_link_type = 0;
    pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_RAW_TRACEPOINT: lkl_bpf_link_type = 1;
    pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_TRACING: lkl_bpf_link_type = 2;
    pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_CGROUP: lkl_bpf_link_type = 3;
    pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_ITER: lkl_bpf_link_type = 4;
    pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_NETNS: lkl_bpf_link_type = 5;
    pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_XDP: lkl_bpf_link_type = 6;
    pub const lkl_bpf_link_type_LKL_MAX_BPF_LINK_TYPE: lkl_bpf_link_type = 7;
    pub type lkl_bpf_link_type = ::std::os::raw::c_uint;
    pub const LKL_BPF_ANY: _bindgen_ty_2 = 0;
    pub const LKL_BPF_NOEXIST: _bindgen_ty_2 = 1;
    pub const LKL_BPF_EXIST: _bindgen_ty_2 = 2;
    pub const LKL_BPF_F_LOCK: _bindgen_ty_2 = 4;
    pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
    pub const LKL_BPF_F_NO_PREALLOC: _bindgen_ty_3 = 1;
    pub const LKL_BPF_F_NO_COMMON_LRU: _bindgen_ty_3 = 2;
    pub const LKL_BPF_F_NUMA_NODE: _bindgen_ty_3 = 4;
    pub const LKL_BPF_F_RDONLY: _bindgen_ty_3 = 8;
    pub const LKL_BPF_F_WRONLY: _bindgen_ty_3 = 16;
    pub const LKL_BPF_F_STACK_BUILD_ID: _bindgen_ty_3 = 32;
    pub const LKL_BPF_F_ZERO_SEED: _bindgen_ty_3 = 64;
    pub const LKL_BPF_F_RDONLY_PROG: _bindgen_ty_3 = 128;
    pub const LKL_BPF_F_WRONLY_PROG: _bindgen_ty_3 = 256;
    pub const LKL_BPF_F_CLONE: _bindgen_ty_3 = 512;
    pub const LKL_BPF_F_MMAPABLE: _bindgen_ty_3 = 1024;
    pub const LKL_BPF_F_PRESERVE_ELEMS: _bindgen_ty_3 = 2048;
    pub const LKL_BPF_F_INNER_MAP: _bindgen_ty_3 = 4096;
    pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
    pub const lkl_bpf_stats_type_LKL_BPF_STATS_RUN_TIME: lkl_bpf_stats_type = 0;
    pub type lkl_bpf_stats_type = ::std::os::raw::c_uint;
    pub const lkl_bpf_stack_build_id_status_LKL_BPF_STACK_BUILD_ID_EMPTY:
        lkl_bpf_stack_build_id_status = 0;
    pub const lkl_bpf_stack_build_id_status_LKL_BPF_STACK_BUILD_ID_VALID:
        lkl_bpf_stack_build_id_status = 1;
    pub const lkl_bpf_stack_build_id_status_LKL_BPF_STACK_BUILD_ID_IP: lkl_bpf_stack_build_id_status =
        2;
    pub type lkl_bpf_stack_build_id_status = ::std::os::raw::c_uint;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct lkl_bpf_stack_build_id {
        pub status: __lkl__s32,
        pub build_id: [::std::os::raw::c_uchar; 20usize],
        pub __bindgen_anon_1: lkl_bpf_stack_build_id__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union lkl_bpf_stack_build_id__bindgen_ty_1 {
        pub offset: __lkl__u64,
        pub ip: __lkl__u64,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_stack_build_id__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_stack_build_id__bindgen_ty_1>(),
            8usize,
            concat!(
                "Size of: ",
                stringify!(lkl_bpf_stack_build_id__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_stack_build_id__bindgen_ty_1>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_bpf_stack_build_id__bindgen_ty_1)
            )
        );
        fn test_field_offset() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_stack_build_id__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_stack_build_id__bindgen_ty_1),
                    "::",
                    stringify!(offset)
                )
            );
        }
        test_field_offset();
        fn test_field_ip() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_stack_build_id__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).ip) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_stack_build_id__bindgen_ty_1),
                    "::",
                    stringify!(ip)
                )
            );
        }
        test_field_ip();
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_stack_build_id() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_stack_build_id>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_bpf_stack_build_id))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_stack_build_id>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_bpf_stack_build_id))
        );
        fn test_field_status() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_stack_build_id>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_stack_build_id),
                    "::",
                    stringify!(status)
                )
            );
        }
        test_field_status();
        fn test_field_build_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_stack_build_id>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).build_id) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_stack_build_id),
                    "::",
                    stringify!(build_id)
                )
            );
        }
        test_field_build_id();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union lkl_bpf_attr {
        pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_1,
        pub __bindgen_anon_2: lkl_bpf_attr__bindgen_ty_2,
        pub batch: lkl_bpf_attr__bindgen_ty_3,
        pub __bindgen_anon_3: lkl_bpf_attr__bindgen_ty_4,
        pub __bindgen_anon_4: lkl_bpf_attr__bindgen_ty_5,
        pub __bindgen_anon_5: lkl_bpf_attr__bindgen_ty_6,
        pub test: lkl_bpf_attr__bindgen_ty_7,
        pub __bindgen_anon_6: lkl_bpf_attr__bindgen_ty_8,
        pub info: lkl_bpf_attr__bindgen_ty_9,
        pub query: lkl_bpf_attr__bindgen_ty_10,
        pub raw_tracepoint: lkl_bpf_attr__bindgen_ty_11,
        pub __bindgen_anon_7: lkl_bpf_attr__bindgen_ty_12,
        pub task_fd_query: lkl_bpf_attr__bindgen_ty_13,
        pub link_create: lkl_bpf_attr__bindgen_ty_14,
        pub link_update: lkl_bpf_attr__bindgen_ty_15,
        pub link_detach: lkl_bpf_attr__bindgen_ty_16,
        pub enable_stats: lkl_bpf_attr__bindgen_ty_17,
        pub iter_create: lkl_bpf_attr__bindgen_ty_18,
        pub prog_bind_map: lkl_bpf_attr__bindgen_ty_19,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_1 {
        pub map_type: __lkl__u32,
        pub key_size: __lkl__u32,
        pub value_size: __lkl__u32,
        pub max_entries: __lkl__u32,
        pub map_flags: __lkl__u32,
        pub inner_map_fd: __lkl__u32,
        pub numa_node: __lkl__u32,
        pub map_name: [::std::os::raw::c_char; 16usize],
        pub map_ifindex: __lkl__u32,
        pub btf_fd: __lkl__u32,
        pub btf_key_type_id: __lkl__u32,
        pub btf_value_type_id: __lkl__u32,
        pub btf_vmlinux_value_type_id: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_1>(),
            64usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_1))
        );
        fn test_field_map_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_type) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(map_type)
                )
            );
        }
        test_field_map_type();
        fn test_field_key_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).key_size) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(key_size)
                )
            );
        }
        test_field_key_size();
        fn test_field_value_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).value_size) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(value_size)
                )
            );
        }
        test_field_value_size();
        fn test_field_max_entries() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).max_entries) as usize - ptr as usize
                },
                12usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(max_entries)
                )
            );
        }
        test_field_max_entries();
        fn test_field_map_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_flags) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(map_flags)
                )
            );
        }
        test_field_map_flags();
        fn test_field_inner_map_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).inner_map_fd) as usize - ptr as usize
                },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(inner_map_fd)
                )
            );
        }
        test_field_inner_map_fd();
        fn test_field_numa_node() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).numa_node) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(numa_node)
                )
            );
        }
        test_field_numa_node();
        fn test_field_map_name() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_name) as usize - ptr as usize
                },
                28usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(map_name)
                )
            );
        }
        test_field_map_name();
        fn test_field_map_ifindex() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_ifindex) as usize - ptr as usize
                },
                44usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(map_ifindex)
                )
            );
        }
        test_field_map_ifindex();
        fn test_field_btf_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).btf_fd) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(btf_fd)
                )
            );
        }
        test_field_btf_fd();
        fn test_field_btf_key_type_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).btf_key_type_id) as usize - ptr as usize
                },
                52usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(btf_key_type_id)
                )
            );
        }
        test_field_btf_key_type_id();
        fn test_field_btf_value_type_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).btf_value_type_id) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(btf_value_type_id)
                )
            );
        }
        test_field_btf_value_type_id();
        fn test_field_btf_vmlinux_value_type_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).btf_vmlinux_value_type_id) as usize - ptr as usize
                },
                60usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_1),
                    "::",
                    stringify!(btf_vmlinux_value_type_id)
                )
            );
        }
        test_field_btf_vmlinux_value_type_id();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_2 {
        pub map_fd: __lkl__u32,
        pub key: __lkl__u64,
        pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1,
        pub flags: __lkl__u64,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1 {
        pub value: __lkl__u64,
        pub next_key: __lkl__u64,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>(),
            8usize,
            concat!(
                "Size of: ",
                stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1)
            )
        );
        fn test_field_value() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1),
                    "::",
                    stringify!(value)
                )
            );
        }
        test_field_value();
        fn test_field_next_key() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).next_key) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1),
                    "::",
                    stringify!(next_key)
                )
            );
        }
        test_field_next_key();
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_2() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_2>(),
            32usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_2))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_2>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_2))
        );
        fn test_field_map_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_fd) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_2),
                    "::",
                    stringify!(map_fd)
                )
            );
        }
        test_field_map_fd();
        fn test_field_key() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_2),
                    "::",
                    stringify!(key)
                )
            );
        }
        test_field_key();
        fn test_field_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_2>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_2),
                    "::",
                    stringify!(flags)
                )
            );
        }
        test_field_flags();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_3 {
        pub in_batch: __lkl__u64,
        pub out_batch: __lkl__u64,
        pub keys: __lkl__u64,
        pub values: __lkl__u64,
        pub count: __lkl__u32,
        pub map_fd: __lkl__u32,
        pub elem_flags: __lkl__u64,
        pub flags: __lkl__u64,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_3() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_3>(),
            56usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_3))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_3>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_3))
        );
        fn test_field_in_batch() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).in_batch) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(in_batch)
                )
            );
        }
        test_field_in_batch();
        fn test_field_out_batch() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).out_batch) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(out_batch)
                )
            );
        }
        test_field_out_batch();
        fn test_field_keys() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).keys) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(keys)
                )
            );
        }
        test_field_keys();
        fn test_field_values() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).values) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(values)
                )
            );
        }
        test_field_values();
        fn test_field_count() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(count)
                )
            );
        }
        test_field_count();
        fn test_field_map_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_fd) as usize - ptr as usize
                },
                36usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(map_fd)
                )
            );
        }
        test_field_map_fd();
        fn test_field_elem_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).elem_flags) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(elem_flags)
                )
            );
        }
        test_field_elem_flags();
        fn test_field_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_3>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_3),
                    "::",
                    stringify!(flags)
                )
            );
        }
        test_field_flags();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_4 {
        pub prog_type: __lkl__u32,
        pub insn_cnt: __lkl__u32,
        pub insns: __lkl__u64,
        pub license: __lkl__u64,
        pub log_level: __lkl__u32,
        pub log_size: __lkl__u32,
        pub log_buf: __lkl__u64,
        pub kern_version: __lkl__u32,
        pub prog_flags: __lkl__u32,
        pub prog_name: [::std::os::raw::c_char; 16usize],
        pub prog_ifindex: __lkl__u32,
        pub expected_attach_type: __lkl__u32,
        pub prog_btf_fd: __lkl__u32,
        pub func_info_rec_size: __lkl__u32,
        pub func_info: __lkl__u64,
        pub func_info_cnt: __lkl__u32,
        pub line_info_rec_size: __lkl__u32,
        pub line_info: __lkl__u64,
        pub line_info_cnt: __lkl__u32,
        pub attach_btf_id: __lkl__u32,
        pub attach_prog_fd: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_4() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_4>(),
            120usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_4))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_4>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_4))
        );
        fn test_field_prog_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prog_type) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(prog_type)
                )
            );
        }
        test_field_prog_type();
        fn test_field_insn_cnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).insn_cnt) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(insn_cnt)
                )
            );
        }
        test_field_insn_cnt();
        fn test_field_insns() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).insns) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(insns)
                )
            );
        }
        test_field_insns();
        fn test_field_license() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).license) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(license)
                )
            );
        }
        test_field_license();
        fn test_field_log_level() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).log_level) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(log_level)
                )
            );
        }
        test_field_log_level();
        fn test_field_log_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).log_size) as usize - ptr as usize
                },
                28usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(log_size)
                )
            );
        }
        test_field_log_size();
        fn test_field_log_buf() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).log_buf) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(log_buf)
                )
            );
        }
        test_field_log_buf();
        fn test_field_kern_version() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).kern_version) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(kern_version)
                )
            );
        }
        test_field_kern_version();
        fn test_field_prog_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prog_flags) as usize - ptr as usize
                },
                44usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(prog_flags)
                )
            );
        }
        test_field_prog_flags();
        fn test_field_prog_name() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prog_name) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(prog_name)
                )
            );
        }
        test_field_prog_name();
        fn test_field_prog_ifindex() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prog_ifindex) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(prog_ifindex)
                )
            );
        }
        test_field_prog_ifindex();
        fn test_field_expected_attach_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).expected_attach_type) as usize - ptr as usize
                },
                68usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(expected_attach_type)
                )
            );
        }
        test_field_expected_attach_type();
        fn test_field_prog_btf_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prog_btf_fd) as usize - ptr as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(prog_btf_fd)
                )
            );
        }
        test_field_prog_btf_fd();
        fn test_field_func_info_rec_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).func_info_rec_size) as usize - ptr as usize
                },
                76usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(func_info_rec_size)
                )
            );
        }
        test_field_func_info_rec_size();
        fn test_field_func_info() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).func_info) as usize - ptr as usize
                },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(func_info)
                )
            );
        }
        test_field_func_info();
        fn test_field_func_info_cnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).func_info_cnt) as usize - ptr as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(func_info_cnt)
                )
            );
        }
        test_field_func_info_cnt();
        fn test_field_line_info_rec_size() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).line_info_rec_size) as usize - ptr as usize
                },
                92usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(line_info_rec_size)
                )
            );
        }
        test_field_line_info_rec_size();
        fn test_field_line_info() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).line_info) as usize - ptr as usize
                },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(line_info)
                )
            );
        }
        test_field_line_info();
        fn test_field_line_info_cnt() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).line_info_cnt) as usize - ptr as usize
                },
                104usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(line_info_cnt)
                )
            );
        }
        test_field_line_info_cnt();
        fn test_field_attach_btf_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).attach_btf_id) as usize - ptr as usize
                },
                108usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(attach_btf_id)
                )
            );
        }
        test_field_attach_btf_id();
        fn test_field_attach_prog_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_4>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).attach_prog_fd) as usize - ptr as usize
                },
                112usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_4),
                    "::",
                    stringify!(attach_prog_fd)
                )
            );
        }
        test_field_attach_prog_fd();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_5 {
        pub pathname: __lkl__u64,
        pub bpf_fd: __lkl__u32,
        pub file_flags: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_5() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_5>(),
            16usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_5))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_5>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_5))
        );
        fn test_field_pathname() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_5>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).pathname) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_5),
                    "::",
                    stringify!(pathname)
                )
            );
        }
        test_field_pathname();
        fn test_field_bpf_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_5>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).bpf_fd) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_5),
                    "::",
                    stringify!(bpf_fd)
                )
            );
        }
        test_field_bpf_fd();
        fn test_field_file_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_5>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).file_flags) as usize - ptr as usize
                },
                12usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_5),
                    "::",
                    stringify!(file_flags)
                )
            );
        }
        test_field_file_flags();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_6 {
        pub target_fd: __lkl__u32,
        pub attach_bpf_fd: __lkl__u32,
        pub attach_type: __lkl__u32,
        pub attach_flags: __lkl__u32,
        pub replace_bpf_fd: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_6() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_6>(),
            20usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_6))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_6>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_6))
        );
        fn test_field_target_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_6>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).target_fd) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_6),
                    "::",
                    stringify!(target_fd)
                )
            );
        }
        test_field_target_fd();
        fn test_field_attach_bpf_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_6>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).attach_bpf_fd) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_6),
                    "::",
                    stringify!(attach_bpf_fd)
                )
            );
        }
        test_field_attach_bpf_fd();
        fn test_field_attach_type() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_6>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).attach_type) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_6),
                    "::",
                    stringify!(attach_type)
                )
            );
        }
        test_field_attach_type();
        fn test_field_attach_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_6>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).attach_flags) as usize - ptr as usize
                },
                12usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_6),
                    "::",
                    stringify!(attach_flags)
                )
            );
        }
        test_field_attach_flags();
        fn test_field_replace_bpf_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_6>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).replace_bpf_fd) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_6),
                    "::",
                    stringify!(replace_bpf_fd)
                )
            );
        }
        test_field_replace_bpf_fd();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_7 {
        pub prog_fd: __lkl__u32,
        pub retval: __lkl__u32,
        pub data_size_in: __lkl__u32,
        pub data_size_out: __lkl__u32,
        pub data_in: __lkl__u64,
        pub data_out: __lkl__u64,
        pub repeat: __lkl__u32,
        pub duration: __lkl__u32,
        pub ctx_size_in: __lkl__u32,
        pub ctx_size_out: __lkl__u32,
        pub ctx_in: __lkl__u64,
        pub ctx_out: __lkl__u64,
        pub flags: __lkl__u32,
        pub cpu: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_7() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_7>(),
            72usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_7))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_7>(),
            8usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_7))
        );
        fn test_field_prog_fd() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prog_fd) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(prog_fd)
                )
            );
        }
        test_field_prog_fd();
        fn test_field_retval() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).retval) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(retval)
                )
            );
        }
        test_field_retval();
        fn test_field_data_size_in() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).data_size_in) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(data_size_in)
                )
            );
        }
        test_field_data_size_in();
        fn test_field_data_size_out() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).data_size_out) as usize - ptr as usize
                },
                12usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(data_size_out)
                )
            );
        }
        test_field_data_size_out();
        fn test_field_data_in() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).data_in) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(data_in)
                )
            );
        }
        test_field_data_in();
        fn test_field_data_out() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).data_out) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(data_out)
                )
            );
        }
        test_field_data_out();
        fn test_field_repeat() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).repeat) as usize - ptr as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(repeat)
                )
            );
        }
        test_field_repeat();
        fn test_field_duration() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).duration) as usize - ptr as usize
                },
                36usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(duration)
                )
            );
        }
        test_field_duration();
        fn test_field_ctx_size_in() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).ctx_size_in) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(ctx_size_in)
                )
            );
        }
        test_field_ctx_size_in();
        fn test_field_ctx_size_out() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).ctx_size_out) as usize - ptr as usize
                },
                44usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(ctx_size_out)
                )
            );
        }
        test_field_ctx_size_out();
        fn test_field_ctx_in() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).ctx_in) as usize - ptr as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(ctx_in)
                )
            );
        }
        test_field_ctx_in();
        fn test_field_ctx_out() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).ctx_out) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(ctx_out)
                )
            );
        }
        test_field_ctx_out();
        fn test_field_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(flags)
                )
            );
        }
        test_field_flags();
        fn test_field_cpu() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_7>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).cpu) as usize - ptr as usize
                },
                68usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_7),
                    "::",
                    stringify!(cpu)
                )
            );
        }
        test_field_cpu();
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_8 {
        pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1,
        pub next_id: __lkl__u32,
        pub open_flags: __lkl__u32,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1 {
        pub start_id: __lkl__u32,
        pub prog_id: __lkl__u32,
        pub map_id: __lkl__u32,
        pub btf_id: __lkl__u32,
        pub link_id: __lkl__u32,
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>(),
            4usize,
            concat!(
                "Size of: ",
                stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1)
            )
        );
        fn test_field_start_id() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).start_id) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
                    "::",
                    stringify!(start_id)
                )
            );
        }
        test_field_start_id();
        fn test_field_prog_id() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).prog_id) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
                    "::",
                    stringify!(prog_id)
                )
            );
        }
        test_field_prog_id();
        fn test_field_map_id() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).map_id) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
                    "::",
                    stringify!(map_id)
                )
            );
        }
        test_field_map_id();
        fn test_field_btf_id() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).btf_id) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
                    "::",
                    stringify!(btf_id)
                )
            );
        }
        test_field_btf_id();
        fn test_field_link_id() {
            assert_eq!(
                unsafe {
                    let uninit =
                        ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).link_id) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
                    "::",
                    stringify!(link_id)
                )
            );
        }
        test_field_link_id();
    }
    #[test]
    fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_8() {
        assert_eq!(
            ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_8>(),
            12usize,
            concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_8))
        );
        assert_eq!(
            ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_8>(),
            4usize,
            concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_8))
        );
        fn test_field_next_id() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_8>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).next_id) as usize - ptr as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_8),
                    "::",
                    stringify!(next_id)
                )
            );
        }
        test_field_next_id();
        fn test_field_open_flags() {
            assert_eq!(
                unsafe {
                    let uninit = ::std::mem::MaybeUninit::<lkl_bpf_attr__bindgen_ty_8>::uninit();
                    let ptr = uninit.as_ptr();
                    ::std::ptr::addr_of!((*ptr).open_flags) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(lkl_bpf_attr__bindgen_ty_8),
                    "::",
                    stringify!(open_flags)
                )
            );
        }
        test_field_open_flags();
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct lkl_bpf_attr__bindgen_ty_9 {
        pub bpf_fd: __lkl__u32,
